FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.c
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016 - 2019 , NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_clock.h"
#include "fsl_power.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
    #define FSL_COMPONENT_ID        "platform.drivers.clock"
#endif
#define NVALMAX                     ( 0x100U )
#define PVALMAX                     ( 0x20U )
#define MVALMAX                     ( 0x8000U )

#define USB_NVALMAX                 ( 0x4U )
#define USB_PVALMAX                 ( 0x8U )
#define USB_MVALMAX                 ( 0x100U )

#define PLL_MAX_N_DIV               0x100U
#define USB_PLL_MAX_N_DIV           0x100U

#define PLL_MDEC_VAL_P              ( 0U )                          /*!<  MDEC is in bits  16 downto 0 */
#define PLL_MDEC_VAL_M              ( 0x1FFFFUL << PLL_MDEC_VAL_P ) /*!<  NDEC is in bits  9 downto 0 */
#define PLL_NDEC_VAL_P              ( 0U )                          /*!<  NDEC is in bits  9:0 */
#define PLL_NDEC_VAL_M              ( 0x3FFUL << PLL_NDEC_VAL_P )
#define PLL_PDEC_VAL_P              ( 0U )                          /*!<  PDEC is in bits 6:0 */
#define PLL_PDEC_VAL_M              ( 0x7FUL << PLL_PDEC_VAL_P )

#define PLL_MIN_CCO_FREQ_MHZ        ( 275000000U )
#define PLL_MAX_CCO_FREQ_MHZ        ( 550000000U )
#define PLL_LOWER_IN_LIMIT          ( 4000U ) /*!<  Minimum PLL input rate */
#define PLL_MIN_IN_SSMODE           ( 2000000U )
#define PLL_MAX_IN_SSMODE           ( 4000000U )

/*!<  Middle of the range values for spread-spectrum */
#define PLL_SSCG_MF_FREQ_VALUE      4U
#define PLL_SSCG_MC_COMP_VALUE      2U
#define PLL_SSCG_MR_DEPTH_VALUE     4U
#define PLL_SSCG_DITHER_VALUE       0U

/*!<  USB PLL CCO MAX AND MIN FREQ */
#define USB_PLL_MIN_CCO_FREQ_MHZ    ( 156000000U )
#define USB_PLL_MAX_CCO_FREQ_MHZ    ( 320000000U )
#define USB_PLL_LOWER_IN_LIMIT      ( 1000000U ) /*!<  Minimum PLL input rate */

#define USB_PLL_MSEL_VAL_P          ( 0U )       /*!<  MSEL is in bits  7 downto 0 */
#define USB_PLL_MSEL_VAL_M          ( 0xFFU )
#define USB_PLL_PSEL_VAL_P          ( 8U )       /*!<  PDEC is in bits 9:8 */
#define USB_PLL_PSEL_VAL_M          ( 0x3U )
#define USB_PLL_NSEL_VAL_P          ( 10U )      /*!<  NDEC is in bits  11:10 */
#define USB_PLL_NSEL_VAL_M          ( 0x3U )

/*!<  SWITCH USB POSTDIVIDER FOR REGITSER WRITING */
#define SWITCH_USB_PSEL( x ) \
    ( ( ( x ) == 0x0U ) ? 0x1U : ( ( x ) == 0x1U ) ? 0x02U : ( ( x ) == 0x2U ) ? 0x4U : ( ( x ) == 3U ) ? 0x8U : 0U )

/*!<  SYS PLL NDEC reg */
#define PLL_NDEC_VAL_SET( value )        ( ( ( unsigned long ) ( value ) << PLL_NDEC_VAL_P ) & PLL_NDEC_VAL_M )
/*!<  SYS PLL PDEC reg */
#define PLL_PDEC_VAL_SET( value )        ( ( ( unsigned long ) ( value ) << PLL_PDEC_VAL_P ) & PLL_PDEC_VAL_M )
/*!<  SYS PLL MDEC reg */
#define PLL_MDEC_VAL_SET( value )        ( ( ( unsigned long ) ( value ) << PLL_MDEC_VAL_P ) & PLL_MDEC_VAL_M )

/*!<  SYS PLL NSEL reg */
#define USB_PLL_NSEL_VAL_SET( value )    ( ( ( unsigned long ) ( value ) & USB_PLL_NSEL_VAL_M ) << USB_PLL_NSEL_VAL_P )
/*!<  SYS PLL PSEL reg */
#define USB_PLL_PSEL_VAL_SET( value )    ( ( ( unsigned long ) ( value ) & USB_PLL_PSEL_VAL_M ) << USB_PLL_PSEL_VAL_P )
/*!<  SYS PLL MSEL reg */
#define USB_PLL_MSEL_VAL_SET( value )    ( ( ( unsigned long ) ( value ) & USB_PLL_MSEL_VAL_M ) << USB_PLL_MSEL_VAL_P )

/*!<  FRAC control */
#define AUDIO_PLL_FRACT_MD_P        ( 0U )
#define AUDIO_PLL_FRACT_MD_INT_P    ( 15U )
#define AUDIO_PLL_FRACT_MD_M        ( 0x7FFFUL << AUDIO_PLL_FRACT_MD_P )
#define AUDIO_PLL_FRACT_MD_INT_M    ( 0x7FUL << AUDIO_PLL_FRACT_MD_INT_P )

#define AUDIO_PLL_MD_FRACT_SET( value )    ( ( ( unsigned long ) ( value ) << AUDIO_PLL_FRACT_MD_P ) & PLL_FRAC_MD_FRACT_M )
#define AUDIO_PLL_MD_INT_SET( value )      ( ( ( unsigned long ) ( value ) << AUDIO_PLL_FRACT_MD_INT_P ) & AUDIO_PLL_FRACT_MD_INT_M )

/* Saved value of PLL output rate, computed whenever needed to save run-time
 * computation on each call to retrive the PLL rate. */
static uint32_t s_Pll_Freq;
static uint32_t s_Usb_Pll_Freq;
static uint32_t s_Audio_Pll_Freq;

/** External clock rate on the CLKIN pin in Hz. If not used,
 *  set this to 0. Otherwise, set it to the exact rate in Hz this pin is
 *  being driven at. */
static const uint32_t g_I2S_Mclk_Freq = 0U;
static const uint32_t g_Ext_Clk_Freq = 12000000U;
static const uint32_t g_Lcd_Clk_In_Freq = 0U;

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/* Find encoded NDEC value for raw N value, max N = NVALMAX */
static uint32_t pllEncodeN( uint32_t N );
/* Find decoded N value for raw NDEC value */
static uint32_t pllDecodeN( uint32_t NDEC );
/* Find encoded PDEC value for raw P value, max P = PVALMAX */
static uint32_t pllEncodeP( uint32_t P );
/* Find decoded P value for raw PDEC value */
static uint32_t pllDecodeP( uint32_t PDEC );
/* Find encoded MDEC value for raw M value, max M = MVALMAX */
static uint32_t pllEncodeM( uint32_t M );
/* Find decoded M value for raw MDEC value */
static uint32_t pllDecodeM( uint32_t MDEC );
/* Find SELP, SELI, and SELR values for raw M value, max M = MVALMAX */
static void pllFindSel( uint32_t M,
                        uint32_t * pSelP,
                        uint32_t * pSelI,
                        uint32_t * pSelR );
/* Get predivider (N) from PLL NDEC setting */
static uint32_t findPllPreDiv( uint32_t ctrlReg,
                               uint32_t nDecReg );
/* Get postdivider (P) from PLL PDEC setting */
static uint32_t findPllPostDiv( uint32_t ctrlReg,
                                uint32_t pDecReg );
/* Get multiplier (M) from PLL MDEC and BYPASS_FBDIV2 settings */
static uint32_t findPllMMult( uint32_t ctrlReg,
                              uint32_t mDecReg );
/* Convert the binary to fractional part */
static double Binary2Fractional( uint32_t binaryPart );
/* Calculate the powerTimes' power of 2 */
static uint32_t power2Cal( uint32_t powerTimes );
/* Get the greatest common divisor */
static uint32_t FindGreatestCommonDivisor( uint32_t m,
                                           uint32_t n );
/* Set PLL output based on desired output rate */
static pll_error_t CLOCK_GetPllConfig( uint32_t finHz,
                                       uint32_t foutHz,
                                       pll_setup_t * pSetup );

