FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.c
/* Update local PLL rate variable */
static void CLOCK_GetSystemPLLOutFromSetupUpdate( pll_setup_t * pSetup );
static void CLOCK_GetAudioPLLOutFromSetupUpdate( pll_setup_t * pSetup );

/*!
 * @brief Set fro clock frequency.
 * Due to LPC540xx 0A silicon and LPC540xx 1B silicon have different ROM addresses for set fro
 * frequency api, so add this api to get rom version.
 * @param base romVersion pointer to recieve rom version.
 */
#if defined( FSL_FROHF_SETTING_API_ADDRESS_DETERMINE_BY_ROM_VERSION ) && \
    ( FSL_FROHF_SETTING_API_ADDRESS_DETERMINE_BY_ROM_VERSION )
    static uint32_t CLOCK_GetRomVersion( uint8_t * romVersion );
#endif

static const uint8_t wdtFreqLookup[ 32 ] =
{
    0,  8,  12, 15, 18, 20, 24, 26, 28, 30, 32, 34, 36, 38, 40, 41,
    42, 44, 45, 46, 48, 49, 50, 52, 53, 54, 56, 57, 58, 59, 60, 61
};

/*******************************************************************************
 * Code
 ******************************************************************************/
#if defined( FSL_FROHF_SETTING_API_ADDRESS_DETERMINE_BY_ROM_VERSION ) && \
    ( FSL_FROHF_SETTING_API_ADDRESS_DETERMINE_BY_ROM_VERSION )
    static uint32_t CLOCK_GetRomVersion( uint8_t * romVersion )
    {
        uint32_t command[ 5 ] = { 0U }, result[ 4 ] = { 0U };

        command[ 0 ] = 55U;
        result[ 0 ] = 0;
        result[ 1 ] = 0;
        ( ( void ( * )( uint32_t cmd[ 5 ], uint32_t stat[ 4 ] ) )FSL_FEATURE_SYSCON_IAP_ENTRY_LOCATION )( command, result );

        *romVersion = ( uint8_t ) ( result[ 1 ] );

        return result[ 0 ];
    }
#endif /* if defined( FSL_FROHF_SETTING_API_ADDRESS_DETERMINE_BY_ROM_VERSION ) && ( FSL_FROHF_SETTING_API_ADDRESS_DETERMINE_BY_ROM_VERSION ) */

/**
 * brief
 *  Initialize the Core clock to given frequency (12, 48 or 96 MHz), this API is implememnt in ROM code.
 * Turns on FRO and uses default CCO, if freq is 12000000, then high speed output is off, else high speed
 * output is enabled.
 * Usage: CLOCK_SetupFROClocking(frequency), (frequency must be one of 12, 48 or 96 MHz)
 *  Note: Need to make sure ROM and OTP has power(PDRUNCFG0[17,29]= 0U) before calling this API since this API is
 * implemented in ROM code and the FROHF TRIM value is stored in OTP
 *
 * param froFreq target fro frequency.
 * return   Nothing
 */

void CLOCK_SetupFROClocking( uint32_t froFreq )
{
    uint32_t froRomAddr = 0U;

    #if defined( FSL_FROHF_SETTING_API_ADDRESS_DETERMINE_BY_ROM_VERSION ) && \
    ( FSL_FROHF_SETTING_API_ADDRESS_DETERMINE_BY_ROM_VERSION )
        uint8_t romVersion = 0U;

        if( CLOCK_GetRomVersion( &romVersion ) == ( uint32_t ) kStatus_Success )
        {
            if( romVersion == FSL_ROM_VERSION_1B )
            {
                froRomAddr = FSL_ROM_VERSION_1B_FRO_SETTING_ADDR;
            }
            else
            {
                froRomAddr = FSL_ROM_VERSION_0A_FRO_SETTING_ADDR;
            }

            ( *( ( void ( * )( uint32_t funcname ) )( froRomAddr ) ) )( froFreq );
        }
    #else  /* if defined( FSL_FROHF_SETTING_API_ADDRESS_DETERMINE_BY_ROM_VERSION ) && ( FSL_FROHF_SETTING_API_ADDRESS_DETERMINE_BY_ROM_VERSION ) */
        froRomAddr = FSL_ROM_VERSION_0A_FRO_SETTING_ADDR;

        ( *( ( void ( * )( uint32_t ) )( froRomAddr ) ) )( froFreq );
    #endif /* if defined( FSL_FROHF_SETTING_API_ADDRESS_DETERMINE_BY_ROM_VERSION ) && ( FSL_FROHF_SETTING_API_ADDRESS_DETERMINE_BY_ROM_VERSION ) */
}

/* Clock Selection for IP */

/**
 * brief	Configure the clock selection muxes.
 * param	connection	: Clock to be configured.
 * return	Nothing
 */
void CLOCK_AttachClk( clock_attach_id_t connection )
{
    uint8_t mux;
    uint8_t sel;
    uint16_t item;
    uint32_t tmp32 = ( uint32_t ) connection;
    uint32_t i;
    volatile uint32_t * pClkSel;

    pClkSel = &( SYSCON->STICKCLKSEL );

    if( kNONE_to_NONE != connection )
    {
        for( i = 0U; i < 2U; i++ )
        {
            if( tmp32 == 0U )
            {
                break;
            }

            item = ( uint16_t ) GET_ID_ITEM( tmp32 );

            if( item != 0UL )
            {
                mux = GET_ID_ITEM_MUX( item );
                sel = GET_ID_ITEM_SEL( item );

                if( mux == CM_ASYNCAPB )
                {
                    SYSCON->ASYNCAPBCTRL = SYSCON_ASYNCAPBCTRL_ENABLE( 1 );
                    ASYNC_SYSCON->ASYNCAPBCLKSELA = sel;
                }
                else
                {
                    ( ( volatile uint32_t * ) pClkSel )[ mux ] = sel;
                }
            }

            tmp32 = GET_ID_NEXT_ITEM( tmp32 ); /* pick up next descriptor */
        }
    }
}

/* Return the actual clock attach id */

/**
 * brief   Get the actual clock attach id.
 * This fuction uses the offset in input attach id, then it reads the actual source value in
 * the register and combine the offset to obtain an actual attach id.
 * param   attachId  : Clock attach id to get.
 * return  Clock source value.
 */
clock_attach_id_t CLOCK_GetClockAttachId( clock_attach_id_t attachId )
{
    uint8_t mux;
    uint8_t actualSel;
    uint32_t tmp32 = ( uint32_t ) attachId;
    uint32_t i;
    uint32_t actualAttachId = 0U;
    uint32_t selector = GET_ID_SELECTOR( tmp32 );
    volatile uint32_t * pClkSel;

    pClkSel = &( SYSCON->STICKCLKSEL );

    if( kNONE_to_NONE == attachId )
    {
        return kNONE_to_NONE;
    }

    for( i = 0U; i < 2U; i++ )
    {
        mux = GET_ID_ITEM_MUX( tmp32 );

        if( tmp32 != 0UL )
        {
            if( mux == CM_ASYNCAPB )
            {
                actualSel = ( uint8_t ) ( ASYNC_SYSCON->ASYNCAPBCLKSELA );
            }
            else
            {
                actualSel = ( uint8_t ) ( ( ( volatile uint32_t * ) pClkSel )[ mux ] );
            }

            /* Consider the combination of two registers */
            actualAttachId |= CLK_ATTACH_ID( mux, actualSel, i );
        }

        tmp32 = GET_ID_NEXT_ITEM( tmp32 ); /*!<  pick up next descriptor */
    }

    actualAttachId |= selector;

    return ( clock_attach_id_t ) actualAttachId;
}

