FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.c
/* Set IP Clock Divider */

/**
 * brief	Setup peripheral clock dividers.
 * param	div_name	: Clock divider name
 * param divided_by_value: Value to be divided
 * param reset :  Whether to reset the divider counter.
 * return	Nothing
 */
void CLOCK_SetClkDiv( clock_div_name_t div_name,
                      uint32_t divided_by_value,
                      bool reset )
{
    volatile uint32_t * pClkDiv;

    pClkDiv = &( SYSCON->SYSTICKCLKDIV );

    if( reset )
    {
        ( ( volatile uint32_t * ) pClkDiv )[ ( uint8_t ) div_name ] = 1UL << 29U;
    }

    if( divided_by_value == 0U ) /*!<  halt */
    {
        ( ( volatile uint32_t * ) pClkDiv )[ ( uint8_t ) div_name ] = 1UL << 30U;
    }
    else
    {
        ( ( volatile uint32_t * ) pClkDiv )[ ( uint8_t ) div_name ] = ( divided_by_value - 1U );
    }
}

/* Get CLOCK OUT Clk */

/*! brief	Return Frequency of ClockOut
 *  return	Frequency of ClockOut
 */
uint32_t CLOCK_GetClockOutClkFreq( void )
{
    uint32_t freq = 0U;

    switch( SYSCON->CLKOUTSELA )
    {
        case 0U:
            freq = CLOCK_GetCoreSysClkFreq();
            break;

        case 1U:
            freq = CLOCK_GetExtClkFreq();
            break;

        case 2U:
            freq = CLOCK_GetWdtOscFreq();
            break;

        case 3U:
            freq = CLOCK_GetFroHfFreq();
            break;

        case 4U:
            freq = CLOCK_GetPllOutFreq();
            break;

        case 5U:
            freq = CLOCK_GetUsbPllOutFreq();
            break;

        case 6U:
            freq = CLOCK_GetAudioPllOutFreq();
            break;

        case 7U:
            freq = CLOCK_GetOsc32KFreq();
            break;

        default:
            freq = 0U;
            break;
    }

    return freq / ( ( SYSCON->CLKOUTDIV & 0xffU ) + 1U );
}

/* Get SPIFI Clk */

/*! brief	Return Frequency of Spifi Clock
 *  return	Frequency of Spifi.
 */
uint32_t CLOCK_GetSpifiClkFreq( void )
{
    uint32_t freq = 0U;

    switch( SYSCON->SPIFICLKSEL )
    {
        case 0U:
            freq = CLOCK_GetCoreSysClkFreq();
            break;

        case 1U:
            freq = CLOCK_GetPllOutFreq();
            break;

        case 2U:
            freq = CLOCK_GetUsbPllOutFreq();
            break;

        case 3U:
            freq = CLOCK_GetFroHfFreq();
            break;

        case 4U:
            freq = CLOCK_GetAudioPllOutFreq();
            break;

        case 7U:
            freq = 0U;
            break;

        default:
            freq = 0U;
            break;
    }

    return freq / ( ( SYSCON->SPIFICLKDIV & 0xffU ) + 1U );
}

/* Get ADC Clk */

/*! brief	Return Frequency of Adc Clock
 *  return	Frequency of Adc Clock.
 */
uint32_t CLOCK_GetAdcClkFreq( void )
{
    uint32_t freq = 0U;

    switch( SYSCON->ADCCLKSEL )
    {
        case 0U:
            freq = CLOCK_GetFroHfFreq();
            break;

        case 1U:
            freq = CLOCK_GetPllOutFreq();
            break;

        case 2U:
            freq = CLOCK_GetUsbPllOutFreq();
            break;

        case 3U:
            freq = CLOCK_GetAudioPllOutFreq();
            break;

        case 7U:
            freq = 0U;
            break;

        default:
            freq = 0U;
            break;
    }

    return freq / ( ( SYSCON->ADCCLKDIV & 0xffU ) + 1U );
}

/* Get USB0 Clk */

/*! brief	Return Frequency of Usb0 Clock
 *  return	Frequency of Usb0 Clock.
 */
uint32_t CLOCK_GetUsb0ClkFreq( void )
{
    uint32_t freq = 0U;

    switch( SYSCON->USB0CLKSEL )
    {
        case 0U:
            freq = CLOCK_GetFroHfFreq();
            break;

        case 1U:
            freq = CLOCK_GetPllOutFreq();
            break;

        case 2U:
            freq = CLOCK_GetUsbPllOutFreq();
            break;

        case 7U:
            freq = 0U;
            break;

        default:
            freq = 0U;
            break;
    }

    return freq / ( ( SYSCON->USB0CLKDIV & 0xffU ) + 1U );
}

/* Get USB1 Clk */

/*! brief	Return Frequency of Usb1 Clock
 *  return	Frequency of Usb1 Clock.
 */
uint32_t CLOCK_GetUsb1ClkFreq( void )
{
    uint32_t freq = 0U;

    switch( SYSCON->USB1CLKSEL )
    {
        case 0U:
            freq = CLOCK_GetCoreSysClkFreq();
            break;

        case 1U:
            freq = CLOCK_GetPllOutFreq();
            break;

        case 2U:
            freq = CLOCK_GetUsbPllOutFreq();
            break;

        case 7U:
            freq = 0U;
            break;

        default:
            freq = 0U;
            break;
    }

    return freq / ( ( SYSCON->USB1CLKDIV & 0xffU ) + 1U );
}

/* Get MCLK Clk */

/*! brief	Return Frequency of MClk Clock
 *  return	Frequency of MClk Clock.
 */
uint32_t CLOCK_GetMclkClkFreq( void )
{
    uint32_t freq = 0U;

    switch( SYSCON->MCLKCLKSEL )
    {
        case 0U:
            freq = CLOCK_GetFroHfFreq() / ( ( SYSCON->FROHFDIV & 0xffu ) + 1U );
            break;

        case 1U:
            freq = CLOCK_GetAudioPllOutFreq();
            break;

        case 7U:
            freq = 0U;
            break;

        default:
            freq = 0U;
            break;
    }

    return freq / ( ( SYSCON->MCLKDIV & 0xffU ) + 1U );
}

/* Get SCTIMER Clk */

/*! brief	Return Frequency of SCTimer Clock
 *  return	Frequency of SCTimer Clock.
 */
uint32_t CLOCK_GetSctClkFreq( void )
{
    uint32_t freq = 0U;

    switch( SYSCON->SCTCLKSEL )
    {
        case 0U:
            freq = CLOCK_GetCoreSysClkFreq();
            break;

        case 1U:
            freq = CLOCK_GetPllOutFreq();
            break;

        case 2U:
            freq = CLOCK_GetFroHfFreq();
            break;

        case 3U:
            freq = CLOCK_GetAudioPllOutFreq();
            break;

        case 7U:
            freq = 0U;
            break;

        default:
            freq = 0U;
            break;
    }

    return freq / ( ( SYSCON->SCTCLKDIV & 0xffU ) + 1U );
}

/* Get SDIO Clk */

/*! brief	Return Frequency of SDIO Clock
 *  return	Frequency of SDIO Clock.
 */
uint32_t CLOCK_GetSdioClkFreq( void )
{
    uint32_t freq = 0U;

    switch( SYSCON->SDIOCLKSEL )
    {
        case 0U:
            freq = CLOCK_GetCoreSysClkFreq();
            break;

