FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.c
        case 1U:
            freq = CLOCK_GetPllOutFreq();
            break;

        case 2U:
            freq = CLOCK_GetUsbPllOutFreq();
            break;

        case 3U:
            freq = CLOCK_GetFroHfFreq();
            break;

        case 4U:
            freq = CLOCK_GetAudioPllOutFreq();
            break;

        case 7U:
            freq = 0U;
            break;

        default:
            freq = 0U;
            break;
    }

    return freq / ( ( SYSCON->SDIOCLKDIV & 0xffU ) + 1U );
}

/* Get LCD Clk */

/*! brief	Return Frequency of LCD Clock
 *  return	Frequency of LCD Clock.
 */
uint32_t CLOCK_GetLcdClkFreq( void )
{
    uint32_t freq = 0U;

    switch( SYSCON->LCDCLKSEL )
    {
        case 0U:
            freq = CLOCK_GetCoreSysClkFreq();
            break;

        case 1U:
            freq = CLOCK_GetLcdClkIn();
            break;

        case 2U:
            freq = CLOCK_GetFroHfFreq();
            break;

        case 3U:
            freq = 0U;
            break;

        default:
            freq = 0U;
            break;
    }

    return freq / ( ( SYSCON->LCDCLKDIV & 0xffU ) + 1U );
}

/* Get LCD CLK IN Clk */

/*! brief	Return Frequency of LCD CLKIN Clock
 *  return	Frequency of LCD CLKIN Clock.
 */
uint32_t CLOCK_GetLcdClkIn( void )
{
    return g_Lcd_Clk_In_Freq;
}

/* Get FRO 12M Clk */

/*! brief	Return Frequency of FRO 12MHz
 *  return	Frequency of FRO 12MHz
 */
uint32_t CLOCK_GetFro12MFreq( void )
{
    return ( ( SYSCON->PDRUNCFG[ 0 ] & SYSCON_PDRUNCFG_PDEN_FRO_MASK ) != 0UL ) ? 0U : 12000000U;
}

/* Get EXT OSC Clk */

/*! brief	Return Frequency of External Clock
 *  return	Frequency of External Clock. If no external clock is used returns 0.
 */
uint32_t CLOCK_GetExtClkFreq( void )
{
    return g_Ext_Clk_Freq;
}

/* Get WATCH DOG Clk */

/*! brief	Return Frequency of Watchdog Oscillator
 *  return	Frequency of Watchdog Oscillator
 */
uint32_t CLOCK_GetWdtOscFreq( void )
{
    uint8_t freq_sel, div_sel;

    if( ( SYSCON->PDRUNCFG[ 0 ] & SYSCON_PDRUNCFG_PDEN_WDT_OSC_MASK ) != 0UL )
    {
        return 0U;
    }
    else
    {
        div_sel = ( uint8_t ) ( ( ( SYSCON->WDTOSCCTRL & 0x1fU ) + 1U ) << 1U );
        freq_sel =
            wdtFreqLookup[ ( ( SYSCON->WDTOSCCTRL & SYSCON_WDTOSCCTRL_FREQSEL_MASK ) >> SYSCON_WDTOSCCTRL_FREQSEL_SHIFT ) ];
        return ( ( uint32_t ) freq_sel * 50000U ) / ( ( uint32_t ) div_sel );
    }
}

/* Get HF FRO Clk */

/*! brief	Return Frequency of High-Freq output of FRO
 *  return	Frequency of High-Freq output of FRO
 */
uint32_t CLOCK_GetFroHfFreq( void )
{
    if( ( ( SYSCON->PDRUNCFG[ 0 ] & SYSCON_PDRUNCFG_PDEN_FRO_MASK ) != 0UL ) ||
        ( 0UL == ( SYSCON->FROCTRL & SYSCON_FROCTRL_HSPDCLK_MASK ) ) )
    {
        return 0U;
    }

    if( ( SYSCON->FROCTRL & SYSCON_FROCTRL_SEL_MASK ) != 0UL )
    {
        return 96000000U;
    }
    else
    {
        return 48000000U;
    }
}

/* Get SYSTEM PLL Clk */

/*! brief	Return Frequency of PLL
 *  return	Frequency of PLL
 */
uint32_t CLOCK_GetPllOutFreq( void )
{
    return s_Pll_Freq;
}

/* Get AUDIO PLL Clk */

/*! brief	Return Frequency of AUDIO PLL
 *  return	Frequency of PLL
 */
uint32_t CLOCK_GetAudioPllOutFreq( void )
{
    return s_Audio_Pll_Freq;
}

/* Get USB PLL Clk */

/*! brief	Return Frequency of USB PLL
 *  return	Frequency of PLL
 */
uint32_t CLOCK_GetUsbPllOutFreq( void )
{
    return s_Usb_Pll_Freq;
}

/* Get RTC OSC Clk */

/*! brief	Return Frequency of 32kHz osc
 *  return	Frequency of 32kHz osc
 */
uint32_t CLOCK_GetOsc32KFreq( void )
{
    return CLK_RTC_32K_CLK; /* Needs to be corrected to check that RTC Clock is enabled */
}

/* Get MAIN Clk */

/*! brief	Return Frequency of Core System
 *  return	Frequency of Core System
 */
uint32_t CLOCK_GetCoreSysClkFreq( void )
{
    uint32_t freq = 0U;

    switch( SYSCON->MAINCLKSELB )
    {
        case 0U:

            if( SYSCON->MAINCLKSELA == 0U )
            {
                freq = CLOCK_GetFro12MFreq();
            }
            else if( SYSCON->MAINCLKSELA == 1U )
            {
                freq = CLOCK_GetExtClkFreq();
            }
            else if( SYSCON->MAINCLKSELA == 2U )
            {
                freq = CLOCK_GetWdtOscFreq();
            }
            else if( SYSCON->MAINCLKSELA == 3U )
            {
                freq = CLOCK_GetFroHfFreq();
            }
            else
            {
                /* Add comment to prevent the case of rule 15.7. */
            }

            break;

        case 2U:
            freq = CLOCK_GetPllOutFreq();
            break;

        case 3U:
            freq = CLOCK_GetOsc32KFreq();
            break;

        default:
            freq = 0U;
            break;
    }

    return freq;
}

/* Get I2S MCLK Clk */

/*! brief	Return Frequency of I2S MCLK Clock
 *  return	Frequency of I2S MCLK Clock
 */
uint32_t CLOCK_GetI2SMClkFreq( void )
{
    return g_I2S_Mclk_Freq;
}

/* Get ASYNC APB Clk */

/*! brief	Return Frequency of Asynchronous APB Clock
 *  return	Frequency of Asynchronous APB Clock Clock
 */
uint32_t CLOCK_GetAsyncApbClkFreq( void )
{
    async_clock_src_t clkSrc;
    uint32_t clkRate;

    clkSrc = CLOCK_GetAsyncApbClkSrc();

    switch( clkSrc )
    {
        case kCLOCK_AsyncMainClk:
            clkRate = CLOCK_GetCoreSysClkFreq();
            break;

        case kCLOCK_AsyncFro12Mhz:
            clkRate = CLK_FRO_12MHZ;
            break;

        default:
            clkRate = 0U;
            break;
    }

    return clkRate;
}

/* Get MCAN Clk */

/*! brief	Return Frequency of MCAN Clock
 *  param	MCanSel : 0U: MCAN0; 1U: MCAN1
 *  return	Frequency of MCAN Clock
 */
uint32_t CLOCK_GetMCanClkFreq( uint32_t MCanSel )
{
    uint32_t freq = 0U;

    switch( MCanSel )
    {
        case 0U:
            freq = CLOCK_GetCoreSysClkFreq() / ( ( SYSCON->CAN0CLKDIV & 0xffU ) + 1U );
            break;

        case 1U:
            freq = CLOCK_GetCoreSysClkFreq() / ( ( SYSCON->CAN1CLKDIV & 0xffU ) + 1U );
            break;

        default:
            freq = 0U;
            break;
    }

    return freq;
}

/* Get FLEXCOMM Clk */

/*! brief	Return Frequency of Flexcomm functional Clock
 *  return	Frequency of Flexcomm functional Clock
 */
uint32_t CLOCK_GetFlexCommClkFreq( uint32_t id )
{
    uint32_t freq = 0U;

    if( id != 10U )
    {
        switch( SYSCON->FCLKSEL[ id ] )
        {
            case 0U:
                freq = CLOCK_GetFro12MFreq();
                break;

