FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.c
            case 1U:
                freq = CLOCK_GetFroHfFreq() / ( ( SYSCON->FROHFDIV & 0xffu ) + 1U );
                break;

            case 2U:
                freq = CLOCK_GetAudioPllOutFreq();
                break;

            case 3U:
                freq = CLOCK_GetI2SMClkFreq();
                break;

            case 4U:
                freq = CLOCK_GetFrgClkFreq();
                break;

            default:
                freq = 0U;
                break;
        }
    }
    else
    {
        switch( SYSCON->FCLKSEL10 )
        {
            case 0U:
                freq = CLOCK_GetCoreSysClkFreq();
                break;

            case 1U:
                freq = CLOCK_GetPllOutFreq();
                break;

            case 2U:
                freq = CLOCK_GetUsbPllOutFreq();
                break;

            case 3U:
                freq = CLOCK_GetFroHfFreq();
                break;

            case 4U:
                freq = CLOCK_GetAudioPllOutFreq();
                break;

            default:
                freq = 0U;
                break;
        }
    }

    return freq;
}

/* Get FRG Clk */
uint32_t CLOCK_GetFRGInputClock( void )
{
    uint32_t freq = 0U;

    switch( SYSCON->FRGCLKSEL )
    {
        case 0U:
            freq = CLOCK_GetCoreSysClkFreq();
            break;

        case 1U:
            freq = CLOCK_GetPllOutFreq();
            break;

        case 2U:
            freq = CLOCK_GetFro12MFreq();
            break;

        case 3U:
            freq = CLOCK_GetFroHfFreq();
            break;

        default:
            freq = 0U;
            break;
    }

    return freq;
}

/* Get FRG Clk */

/*! brief  Return Frequency of frg
 *  return Frequency of FRG
 */
uint32_t CLOCK_GetFrgClkFreq( void )
{
    uint32_t freq = 0U;

    if( ( SYSCON->FRGCTRL & SYSCON_FRGCTRL_DIV_MASK ) == SYSCON_FRGCTRL_DIV_MASK )
    {
        freq = ( uint32_t ) ( ( ( uint64_t ) CLOCK_GetFRGInputClock() * ( SYSCON_FRGCTRL_DIV_MASK + 1U ) ) /
                              ( ( SYSCON_FRGCTRL_DIV_MASK + 1U ) +
                                ( ( SYSCON->FRGCTRL & SYSCON_FRGCTRL_MULT_MASK ) >> SYSCON_FRGCTRL_MULT_SHIFT ) ) );
    }
    else
    {
        freq = 0U;
    }

    return freq;
}

/* Get FRG Clk */

/*! brief  Return Frequency of dmic
 *  return Frequency of DMIC
 */
uint32_t CLOCK_GetDmicClkFreq( void )
{
    uint32_t freq = 0U;

    switch( SYSCON->DMICCLKSEL )
    {
        case 0U:
            freq = CLOCK_GetFro12MFreq();
            break;

        case 1U:
            freq = CLOCK_GetFroHfFreq();
            break;

        case 2U:
            freq = CLOCK_GetPllOutFreq();
            break;

        case 3U:
            freq = CLOCK_GetI2SMClkFreq();
            break;

        case 4U:
            freq = CLOCK_GetCoreSysClkFreq();
            break;

        case 5U:
            freq = CLOCK_GetWdtOscFreq();
            break;

        default:
            freq = 0U;
            break;
    }

    return freq / ( ( SYSCON->DMICCLKDIV & 0xffU ) + 1U );
}

/* Set FRG Clk */
uint32_t CLOCK_SetFRGClock( uint32_t freq )
{
    assert( 0UL != freq );

    uint32_t input = CLOCK_GetFRGInputClock();
    uint32_t mul;

    if( ( freq > 48000000U ) || ( freq > input ) || ( input / freq >= 2U ) )
    {
        /* FRG output frequency should be less than equal to 48MHz */
        return 0U;
    }
    else
    {
        mul = ( uint32_t ) ( ( ( ( uint64_t ) input - freq ) * 256U ) / ( ( uint64_t ) freq ) );
        SYSCON->FRGCTRL = ( mul << SYSCON_FRGCTRL_MULT_SHIFT ) | SYSCON_FRGCTRL_DIV_MASK;
        return 1U;
    }
}

/* Set IP Clk */

/*! brief	Return Frequency of selected clock
 *  return	Frequency of selected clock
 */
uint32_t CLOCK_GetFreq( clock_name_t clockName )
{
    uint32_t freq;

    switch( clockName )
    {
        case kCLOCK_CoreSysClk:
            freq = CLOCK_GetCoreSysClkFreq();
            break;

        case kCLOCK_BusClk:
            freq = CLOCK_GetCoreSysClkFreq() / ( ( SYSCON->AHBCLKDIV & 0xffU ) + 1U );
            break;

        case kCLOCK_ClockOut:
            freq = CLOCK_GetClockOutClkFreq();
            break;

        case kCLOCK_Mclk:
            freq = CLOCK_GetMclkClkFreq();
            break;

        case kCLOCK_FroHf:
            freq = CLOCK_GetFroHfFreq();
            break;

        case kCLOCK_Fro12M:
            freq = CLOCK_GetFro12MFreq();
            break;

        case kCLOCK_ExtClk:
            freq = CLOCK_GetExtClkFreq();
            break;

        case kCLOCK_PllOut:
            freq = CLOCK_GetPllOutFreq();
            break;

        case kCLOCK_WdtOsc:
            freq = CLOCK_GetWdtOscFreq();
            break;

        case kCLOCK_Frg:
            freq = CLOCK_GetFrgClkFreq();
            break;

        case kCLOCK_AsyncApbClk:
            freq = CLOCK_GetAsyncApbClkFreq();
            break;

        default:
            freq = 0U;
            break;
    }

    return freq;
}

/* Find encoded NDEC value for raw N value, max N = NVALMAX */
static uint32_t pllEncodeN( uint32_t N )
{
    uint32_t x, i;

    /* Find NDec */
    switch( N )
    {
        case 0U:
            x = 0x3FFU;
            break;

        case 1U:
            x = 0x302U;
            break;

        case 2U:
            x = 0x202U;
            break;

        default:
            x = 0x080U;

            for( i = N; i <= NVALMAX; i++ )
            {
                x = ( ( ( x ^ ( x >> 2U ) ^ ( x >> 3U ) ^ ( x >> 4U ) ) & 1U ) << 7U ) | ( ( x >> 1U ) & 0x7FU );
            }

            break;
    }

    return x & ( PLL_NDEC_VAL_M >> PLL_NDEC_VAL_P );
}

/* Find decoded N value for raw NDEC value */
static uint32_t pllDecodeN( uint32_t NDEC )
{
    uint32_t n, x, i;

    /* Find NDec */
    switch( NDEC )
    {
        case 0x3FFU:
            n = 0U;
            break;

        case 0x302U:
            n = 1U;
            break;

        case 0x202U:
            n = 2U;
            break;

        default:
            x = 0x080U;
            n = 0xFFFFFFFFU;

