FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.c
            for( i = NVALMAX; i >= 3U; i-- )
            {
                x = ( ( ( x ^ ( x >> 2U ) ^ ( x >> 3U ) ^ ( x >> 4U ) ) & 1U ) << 7U ) | ( ( x >> 1U ) & 0x7FU );

                if( ( x & ( PLL_NDEC_VAL_M >> PLL_NDEC_VAL_P ) ) == NDEC )
                {
                    /* Decoded value of NDEC */
                    n = i;
                    break;
                }
            }

            break;
    }

    return n;
}

/* Find encoded PDEC value for raw P value, max P = PVALMAX */
static uint32_t pllEncodeP( uint32_t P )
{
    uint32_t x, i;

    /* Find PDec */
    switch( P )
    {
        case 0U:
            x = 0x7FU;
            break;

        case 1U:
            x = 0x62U;
            break;

        case 2U:
            x = 0x42U;
            break;

        default:
            x = 0x10U;

            for( i = P; i <= PVALMAX; i++ )
            {
                x = ( ( ( x ^ ( x >> 2U ) ) & 1U ) << 4U ) | ( ( x >> 1U ) & 0xFU );
            }

            break;
    }

    return x & ( PLL_PDEC_VAL_M >> PLL_PDEC_VAL_P );
}

/* Find decoded P value for raw PDEC value */
static uint32_t pllDecodeP( uint32_t PDEC )
{
    uint32_t p, x, i;

    /* Find PDec */
    switch( PDEC )
    {
        case 0x7FU:
            p = 0U;
            break;

        case 0x62U:
            p = 1U;
            break;

        case 0x42U:
            p = 2U;
            break;

        default:
            x = 0x10U;
            p = 0xFFFFFFFFU;

            for( i = PVALMAX; i >= 3U; i-- )
            {
                x = ( ( ( x ^ ( x >> 2U ) ) & 1U ) << 4U ) | ( ( x >> 1U ) & 0xFU );

                if( ( x & ( PLL_PDEC_VAL_M >> PLL_PDEC_VAL_P ) ) == PDEC )
                {
                    /* Decoded value of PDEC */
                    p = i;
                    break;
                }
            }

            break;
    }

    return p;
}

/* Find encoded MDEC value for raw M value, max M = MVALMAX */
static uint32_t pllEncodeM( uint32_t M )
{
    uint32_t i, x;

    /* Find MDec */
    switch( M )
    {
        case 0U:
            x = 0x1FFFFU;
            break;

        case 1U:
            x = 0x18003U;
            break;

        case 2U:
            x = 0x10003U;
            break;

        default:
            x = 0x04000U;

            for( i = M; i <= MVALMAX; i++ )
            {
                x = ( ( ( x ^ ( x >> 1U ) ) & 1U ) << 14U ) | ( ( x >> 1U ) & 0x3FFFU );
            }

            break;
    }

    return x & ( PLL_MDEC_VAL_M >> PLL_MDEC_VAL_P );
}

/* Find decoded M value for raw MDEC value */
static uint32_t pllDecodeM( uint32_t MDEC )
{
    uint32_t m, i, x;

    /* Find MDec */
    switch( MDEC )
    {
        case 0x1FFFFU:
            m = 0U;
            break;

        case 0x18003U:
            m = 1U;
            break;

        case 0x10003U:
            m = 2U;
            break;

        default:
            x = 0x04000U;
            m = 0xFFFFFFFFU;

            for( i = MVALMAX; i >= 3U; i-- )
            {
                x = ( ( ( x ^ ( x >> 1U ) ) & 1U ) << 14U ) | ( ( x >> 1U ) & 0x3FFFU );

                if( ( x & ( PLL_MDEC_VAL_M >> PLL_MDEC_VAL_P ) ) == MDEC )
                {
                    /* Decoded value of MDEC */
                    m = i;
                    break;
                }
            }

            break;
    }

    return m;
}

/* Find SELP, SELI, and SELR values for raw M value, max M = MVALMAX */
static void pllFindSel( uint32_t M,
                        uint32_t * pSelP,
                        uint32_t * pSelI,
                        uint32_t * pSelR )
{
    /* bandwidth: compute selP from Multiplier */
    if( M < 60U )
    {
        *pSelP = ( M >> 1U ) + 1U;
    }
    else
    {
        *pSelP = PVALMAX - 1U;
    }

    /* bandwidth: compute selI from Multiplier */
    if( M > 16384U )
    {
        *pSelI = 1U;
    }
    else if( M > 8192U )
    {
        *pSelI = 2U;
    }
    else if( M > 2048U )
    {
        *pSelI = 4U;
    }
    else if( M >= 501U )
    {
        *pSelI = 8U;
    }
    else if( M >= 60U )
    {
        *pSelI = 4U * ( 1024U / ( M + 9U ) );
    }
    else
    {
        *pSelI = ( M & 0x3CU ) + 4U;
    }

    if( *pSelI > ( ( 0x3FUL << SYSCON_SYSPLLCTRL_SELI_SHIFT ) >> SYSCON_SYSPLLCTRL_SELI_SHIFT ) )
    {
        *pSelI = ( ( 0x3FUL << SYSCON_SYSPLLCTRL_SELI_SHIFT ) >> SYSCON_SYSPLLCTRL_SELI_SHIFT );
    }

    *pSelR = 0U;
}

/* Get predivider (N) from PLL NDEC setting */
static uint32_t findPllPreDiv( uint32_t ctrlReg,
                               uint32_t nDecReg )
{
    uint32_t preDiv = 1;

    /* Direct input is not used? */
    if( ( ctrlReg & ( 1UL << SYSCON_SYSPLLCTRL_DIRECTI_SHIFT ) ) == 0U )
    {
        /* Decode NDEC value to get (N) pre divider */
        preDiv = pllDecodeN( nDecReg & 0x3FFU );

        if( preDiv == 0U )
        {
            preDiv = 1U;
        }
    }

    /* Adjusted by 1, directi is used to bypass */
    return preDiv;
}

/* Get postdivider (P) from PLL PDEC setting */
static uint32_t findPllPostDiv( uint32_t ctrlReg,
                                uint32_t pDecReg )
{
    uint32_t postDiv = 1U;

    /* Direct input is not used? */
    if( ( ctrlReg & SYSCON_SYSPLLCTRL_DIRECTO_MASK ) == 0U )
    {
        /* Decode PDEC value to get (P) post divider */
        postDiv = 2U * pllDecodeP( pDecReg & 0x7FU );

        if( postDiv == 0U )
        {
            postDiv = 2U;
        }
    }

    /* Adjusted by 1, directo is used to bypass */
    return postDiv;
}

/* Get multiplier (M) from PLL MDEC and BYPASS_FBDIV2 settings */
static uint32_t findPllMMult( uint32_t ctrlReg,
                              uint32_t mDecReg )
{
    uint32_t mMult = 1U;

    /* Decode MDEC value to get (M) multiplier */
    mMult = pllDecodeM( mDecReg & 0x1FFFFU );

    if( mMult == 0U )
    {
        mMult = 1U;
    }

    return mMult;
}

/* Calculate the powerTimes' power of 2 */
static uint32_t power2Cal( uint32_t powerTimes )
{
    uint32_t ret = 1U;
    uint32_t i;

