FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.c
    for( i = 0; i < powerTimes; i++ )
    {
        ret *= 2U;
    }

    return ret;
}

/* Convert the binary to fractional part */
static double Binary2Fractional( uint32_t binaryPart )
{
    double fractional = 0.0;

    for( uint32_t i = 0U; i <= 14U; i++ )
    {
        fractional += ( double ) ( uint32_t ) ( ( binaryPart >> i ) & 0x1U ) / ( double ) ( uint32_t ) power2Cal( 15U - i );
    }

    return fractional;
}

/* Find greatest common divisor between m and n */
static uint32_t FindGreatestCommonDivisor( uint32_t m,
                                           uint32_t n )
{
    uint32_t tmp;

    while( n != 0U )
    {
        tmp = n;
        n = m % n;
        m = tmp;
    }

    return m;
}

/*
 * Set PLL output based on desired output rate.
 * In this function, the it calculates the PLL setting for output frequency from input clock
 * frequency. The calculation would cost a few time. So it is not recommaned to use it frequently.
 * the "pllctrl", "pllndec", "pllpdec", "pllmdec" would updated in this function.
 */
static pll_error_t CLOCK_GetPllConfigInternal( uint32_t finHz,
                                               uint32_t foutHz,
                                               pll_setup_t * pSetup )
{
    uint32_t nDivOutHz, fccoHz, multFccoDiv;
    uint32_t pllPreDivider, pllMultiplier, pllPostDivider;
    uint32_t pllDirectInput, pllDirectOutput;
    uint32_t pllSelP, pllSelI, pllSelR, uplimoff;

    /* Baseline parameters (no input or output dividers) */
    pllPreDivider = 1U;  /* 1 implies pre-divider will be disabled */
    pllPostDivider = 0U; /* 0 implies post-divider will be disabled */
    pllDirectOutput = 1U;
    multFccoDiv = 2U;

    /* Verify output rate parameter */
    if( foutHz > PLL_MAX_CCO_FREQ_MHZ )
    {
        /* Maximum PLL output with post divider=1 cannot go above this frequency */
        return kStatus_PLL_OutputTooHigh;
    }

    if( foutHz < ( PLL_MIN_CCO_FREQ_MHZ / ( PVALMAX << 1U ) ) )
    {
        /* Minmum PLL output with maximum post divider cannot go below this frequency */
        return kStatus_PLL_OutputTooLow;
    }

    /* Verify input rate parameter */
    if( finHz < PLL_LOWER_IN_LIMIT )
    {
        /* Input clock into the PLL cannot be lower than this */
        return kStatus_PLL_InputTooLow;
    }

    /* Find the optimal CCO frequency for the output and input that
     * will keep it inside the PLL CCO range. This may require
     * tweaking the post-divider for the PLL. */
    fccoHz = foutHz;

    while( fccoHz < PLL_MIN_CCO_FREQ_MHZ )
    {
        /* CCO output is less than minimum CCO range, so the CCO output
         * needs to be bumped up and the post-divider is used to bring
         * the PLL output back down. */
        pllPostDivider++;

        if( pllPostDivider > PVALMAX )
        {
            return kStatus_PLL_OutsideIntLimit;
        }

        /* Target CCO goes up, PLL output goes down */
        fccoHz = foutHz * ( pllPostDivider * 2U );
        pllDirectOutput = 0U;
    }

    /* Determine if a pre-divider is needed to get the best frequency */
    if( ( finHz > PLL_LOWER_IN_LIMIT ) && ( fccoHz >= finHz ) )
    {
        uint32_t a = FindGreatestCommonDivisor( fccoHz, ( multFccoDiv * finHz ) );

        if( a > 20000U )
        {
            a = ( multFccoDiv * finHz ) / a;

            if( ( a != 0U ) && ( a < PLL_MAX_N_DIV ) )
            {
                pllPreDivider = a;
            }
        }
    }

    /* Bypass pre-divider hardware if pre-divider is 1 */
    if( pllPreDivider > 1U )
    {
        pllDirectInput = 0U;
    }
    else
    {
        pllDirectInput = 1U;
    }

    /* Determine PLL multipler */
    nDivOutHz = ( finHz / pllPreDivider );
    pllMultiplier = ( fccoHz / nDivOutHz ) / multFccoDiv;

    /* Find optimal values for filter */
    /* Will bumping up M by 1 get us closer to the desired CCO frequency? */
    if( ( nDivOutHz * ( ( multFccoDiv * pllMultiplier * 2U ) + 1U ) ) < ( fccoHz * 2U ) )
    {
        pllMultiplier++;
    }

    /* Setup filtering */
    pllFindSel( pllMultiplier, &pllSelP, &pllSelI, &pllSelR );
    uplimoff = 0U;

    /* Get encoded value for M (mult) and use manual filter, disable SS mode */
    pSetup->pllmdec = PLL_MDEC_VAL_SET( pllEncodeM( pllMultiplier ) );

    /* Get encoded values for N (prediv) and P (postdiv) */
    pSetup->pllndec = PLL_NDEC_VAL_SET( pllEncodeN( pllPreDivider ) );
    pSetup->pllpdec = PLL_PDEC_VAL_SET( pllEncodeP( pllPostDivider ) );

    /* PLL control */
    pSetup->pllctrl = ( pllSelR << SYSCON_SYSPLLCTRL_SELR_SHIFT ) |           /* Filter coefficient */
                      ( pllSelI << SYSCON_SYSPLLCTRL_SELI_SHIFT ) |           /* Filter coefficient */
                      ( pllSelP << SYSCON_SYSPLLCTRL_SELP_SHIFT ) |           /* Filter coefficient */
                      ( 0UL << SYSCON_SYSPLLCTRL_BYPASS_SHIFT ) |             /* PLL bypass mode disabled */
                      ( uplimoff << SYSCON_SYSPLLCTRL_UPLIMOFF_SHIFT ) |      /* SS/fractional mode disabled */
                      ( pllDirectInput << SYSCON_SYSPLLCTRL_DIRECTI_SHIFT ) | /* Bypass pre-divider? */
                      ( pllDirectOutput << SYSCON_SYSPLLCTRL_DIRECTO_SHIFT ); /* Bypass post-divider? */

    return kStatus_PLL_Success;
}

#if ( defined( CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT ) && CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT )
/* Alloct the static buffer for cache. */
    static pll_setup_t gPllSetupCacheStruct[ CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT ];
    static uint32_t gFinHzCache[ CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT ] = { 0 };
    static uint32_t gFoutHzCache[ CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT ] = { 0 };
    static uint32_t gPllSetupCacheIdx = 0U;
#endif /* CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT */

/*
 * Calculate the PLL setting values from input clock freq to output freq.
 */
static pll_error_t CLOCK_GetPllConfig( uint32_t finHz,
                                       uint32_t foutHz,
                                       pll_setup_t * pSetup )
{
    pll_error_t retErr;

    #if ( defined( CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT ) && CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT )
        uint32_t i;

