FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.c
        for( i = 0U; i < CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT; i++ )
        {
            if( ( finHz == gFinHzCache[ i ] ) && ( foutHz == gFoutHzCache[ i ] ) )
            {
                /* Hit the target in cache buffer. */
                pSetup->pllctrl = gPllSetupCacheStruct[ i ].pllctrl;
                pSetup->pllndec = gPllSetupCacheStruct[ i ].pllndec;
                pSetup->pllpdec = gPllSetupCacheStruct[ i ].pllpdec;
                pSetup->pllmdec = gPllSetupCacheStruct[ i ].pllmdec;
                retErr = kStatus_PLL_Success;
                break;
            }
        }

        if( i < CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT )
        {
            return retErr;
        }
    #endif /* CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT */

    /* No cache or did not hit the cache. */
    retErr = CLOCK_GetPllConfigInternal( finHz, foutHz, pSetup );

    #if ( defined( CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT ) && CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT )
        if( kStatus_PLL_Success == retErr )
        {
            /* Cache the most recent calulation result into buffer. */
            gFinHzCache[ gPllSetupCacheIdx ] = finHz;
            gFoutHzCache[ gPllSetupCacheIdx ] = foutHz;

            gPllSetupCacheStruct[ gPllSetupCacheIdx ].pllctrl = pSetup->pllctrl;
            gPllSetupCacheStruct[ gPllSetupCacheIdx ].pllndec = pSetup->pllndec;
            gPllSetupCacheStruct[ gPllSetupCacheIdx ].pllpdec = pSetup->pllpdec;
            gPllSetupCacheStruct[ gPllSetupCacheIdx ].pllmdec = pSetup->pllmdec;
            /* Update the index for next available buffer. */
            gPllSetupCacheIdx = ( gPllSetupCacheIdx + 1U ) % CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT;
        }
    #endif /* CLOCK_USR_CFG_PLL_CONFIG_CACHE_COUNT */

    return retErr;
}

/* Update SYSTEM PLL rate variable */
static void CLOCK_GetSystemPLLOutFromSetupUpdate( pll_setup_t * pSetup )
{
    s_Pll_Freq = CLOCK_GetSystemPLLOutFromSetup( pSetup );
}

/* Update AUDIO PLL rate variable */
static void CLOCK_GetAudioPLLOutFromSetupUpdate( pll_setup_t * pSetup )
{
    s_Audio_Pll_Freq = CLOCK_GetAudioPLLOutFromSetup( pSetup );
}

/* Update AUDIO Fractional PLL rate variable */
static void CLOCK_GetAudioPLLOutFromAudioFracSetupUpdate( pll_setup_t * pSetup )
{
    s_Audio_Pll_Freq = CLOCK_GetAudioPLLOutFromFractSetup( pSetup );
}

/* Update USB PLL rate variable */
static void CLOCK_GetUsbPLLOutFromSetupUpdate( const usb_pll_setup_t * pSetup )
{
    s_Usb_Pll_Freq = CLOCK_GetUsbPLLOutFromSetup( pSetup );
}

/* Return System PLL input clock rate */

/*! brief	Return System PLL input clock rate
 *  return	System PLL input clock rate
 */
uint32_t CLOCK_GetSystemPLLInClockRate( void )
{
    uint32_t clkRate = 0U;

    switch( ( SYSCON->SYSPLLCLKSEL & SYSCON_SYSPLLCLKSEL_SEL_MASK ) )
    {
        case 0x00U:
            clkRate = CLK_FRO_12MHZ;
            break;

        case 0x01U:
            clkRate = CLOCK_GetExtClkFreq();
            break;

        case 0x02U:
            clkRate = CLOCK_GetWdtOscFreq();
            break;

        case 0x03U:
            clkRate = CLOCK_GetOsc32KFreq();
            break;

        default:
            clkRate = 0U;
            break;
    }

    return clkRate;
}

/* Return Audio PLL input clock rate */

/*! brief	Return Audio PLL input clock rate
 *  return	Audio PLL input clock rate
 */
uint32_t CLOCK_GetAudioPLLInClockRate( void )
{
    uint32_t clkRate = 0U;

    switch( ( SYSCON->AUDPLLCLKSEL & SYSCON_AUDPLLCLKSEL_SEL_MASK ) )
    {
        case 0x00U:
            clkRate = CLK_FRO_12MHZ;
            break;

        case 0x01U:
            clkRate = CLOCK_GetExtClkFreq();
            break;

        default:
            clkRate = 0U;
            break;
    }

    return clkRate;
}

/* Return System PLL output clock rate from setup structure */

/*! brief	Return System PLL output clock rate from setup structure
 *  param	pSetup	: Pointer to a PLL setup structure
 *  return	System PLL output clock rate the setup structure will generate
 */
uint32_t CLOCK_GetSystemPLLOutFromSetup( pll_setup_t * pSetup )
{
    uint32_t prediv, postdiv, mMult, inPllRate;
    uint64_t workRate;

    inPllRate = CLOCK_GetSystemPLLInClockRate();

    /* If the PLL is bypassed, PLL would not be used and the output of PLL module would just be the input clock*/
    if( ( pSetup->pllctrl & ( SYSCON_SYSPLLCTRL_BYPASS_MASK ) ) == 0U )
    {
        /* PLL is not in bypass mode, get pre-divider, and M divider, post-divider. */

        /*
         * 1. Pre-divider
         * Pre-divider is only available when the DIRECTI is disabled.
         */
        if( 0U == ( pSetup->pllctrl & SYSCON_SYSPLLCTRL_DIRECTI_MASK ) )
        {
            prediv = findPllPreDiv( pSetup->pllctrl, pSetup->pllndec );
        }
        else
        {
            prediv = 1U; /* The pre-divider is bypassed. */
        }

        /*
         * 2. Post-divider
         * Post-divider is only available when the DIRECTO is disabled.
         */
        if( 0U == ( pSetup->pllctrl & SYSCON_SYSPLLCTRL_DIRECTO_MASK ) )
        {
            postdiv = findPllPostDiv( pSetup->pllctrl, pSetup->pllpdec );
        }
        else
        {
            postdiv = 1U; /* The post-divider is bypassed. */
        }

        /* Adjust input clock */
        inPllRate = inPllRate / prediv;

        /* MDEC used for rate */
        mMult = findPllMMult( pSetup->pllctrl, pSetup->pllmdec );
        workRate = ( uint64_t ) inPllRate * ( uint64_t ) mMult;

        workRate = workRate / ( ( uint64_t ) postdiv );
        workRate = workRate * 2U; /* SYS PLL hardware cco is divide by 2 before to M-DIVIDER*/
    }
    else
    {
        /* In bypass mode */
        workRate = ( uint64_t ) inPllRate;
    }

    return ( uint32_t ) workRate;
}

/* Return Usb PLL output clock rate from setup structure */

/*! brief	Return System USB PLL output clock rate from setup structure
 *  param	pSetup	: Pointer to a PLL setup structure
 *  return	System PLL output clock rate the setup structure will generate
 */
uint32_t CLOCK_GetUsbPLLOutFromSetup( const usb_pll_setup_t * pSetup )
{
    uint32_t nsel, psel, msel, inPllRate;
    uint64_t workRate;

    inPllRate = CLOCK_GetExtClkFreq();
    msel = pSetup->msel;
    psel = pSetup->psel;
    nsel = pSetup->nsel;

    /* Make sure the PSEL is correct. */
    if( 0U == SWITCH_USB_PSEL( psel ) )
    {
        return 0UL;
    }

    if( pSetup->fbsel )
    {
        /*integer_mode: Fout = M*(Fin/N),  Fcco = 2*P*M*(Fin/N) */
        workRate = ( ( uint64_t ) inPllRate ) * ( ( uint64_t ) msel + 1U ) / ( ( uint64_t ) nsel + 1U );
    }
    else
    {
        /* non integer_mode: Fout = M*(Fin/N)/(2*P), Fcco = M * (Fin/N) */
        workRate = ( ( uint64_t ) inPllRate / ( ( uint64_t ) nsel + 1U ) ) * ( msel + 1U ) / ( 2U * SWITCH_USB_PSEL( psel ) );
    }

