FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.c
    return ( uint32_t ) workRate;
}

/* Return Audio PLL output clock rate from setup structure */

/*! brief	Return System AUDIO PLL output clock rate from setup structure
 *  param	pSetup	: Pointer to a PLL setup structure
 *  return	System PLL output clock rate the setup structure will generate
 */
uint32_t CLOCK_GetAudioPLLOutFromSetup( pll_setup_t * pSetup )
{
    uint32_t prediv, postdiv, mMult, inPllRate;
    uint64_t workRate;

    inPllRate = CLOCK_GetAudioPLLInClockRate();

    if( ( pSetup->pllctrl & ( 1UL << SYSCON_SYSPLLCTRL_BYPASS_SHIFT ) ) == 0U )
    {
        /* PLL is not in bypass mode, get pre-divider, and M divider, post-divider. */

        /*
         * 1. Pre-divider
         * Pre-divider is only available when the DIRECTI is disabled.
         */
        if( 0U == ( pSetup->pllctrl & SYSCON_AUDPLLCTRL_DIRECTI_MASK ) )
        {
            prediv = findPllPreDiv( pSetup->pllctrl, pSetup->pllndec );
        }
        else
        {
            prediv = 1U; /* The pre-divider is bypassed. */
        }

        /*
         * 2. Post-divider
         * Post-divider is only available when the DIRECTO is disabled.
         */
        if( 0U == ( pSetup->pllctrl & SYSCON_AUDPLLCTRL_DIRECTO_MASK ) )
        {
            postdiv = findPllPostDiv( pSetup->pllctrl, pSetup->pllpdec );
        }
        else
        {
            postdiv = 1U; /* The post-divider is bypassed. */
        }

        /* Adjust input clock */
        inPllRate = inPllRate / prediv;

        /* MDEC used for rate */
        mMult = findPllMMult( pSetup->pllctrl, pSetup->pllmdec );
        workRate = ( uint64_t ) inPllRate * ( uint64_t ) mMult;

        workRate = workRate / ( ( uint64_t ) postdiv );
        workRate = workRate * 2U; /* SYS PLL hardware cco is divide by 2 before to M-DIVIDER*/
    }
    else
    {
        /* In bypass mode */
        workRate = ( uint64_t ) inPllRate;
    }

    return ( uint32_t ) workRate;
}

/* Return Audio PLL output clock rate from audio fractioanl setup structure */

/*! brief	Return System AUDIO PLL output clock rate from audio fractioanl setup structure
 *  param	pSetup	: Pointer to a PLL setup structure
 *  return	System PLL output clock rate the setup structure will generate
 */
uint32_t CLOCK_GetAudioPLLOutFromFractSetup( pll_setup_t * pSetup )
{
    uint32_t prediv, postdiv, inPllRate;
    double workRate, mMultFactional;

    inPllRate = CLOCK_GetAudioPLLInClockRate();

    if( ( pSetup->pllctrl & ( 1UL << SYSCON_SYSPLLCTRL_BYPASS_SHIFT ) ) == 0U )
    {
        /* PLL is not in bypass mode, get pre-divider, and M divider, post-divider. */

        /*
         * 1. Pre-divider
         * Pre-divider is only available when the DIRECTI is disabled.
         */
        if( 0U == ( pSetup->pllctrl & SYSCON_AUDPLLCTRL_DIRECTI_MASK ) )
        {
            prediv = findPllPreDiv( pSetup->pllctrl, pSetup->pllndec );
        }
        else
        {
            prediv = 1U; /* The pre-divider is bypassed. */
        }

        /*
         * 2. Post-divider
         * Post-divider is only available when the DIRECTO is disabled.
         */
        if( 0U == ( pSetup->pllctrl & SYSCON_AUDPLLCTRL_DIRECTO_MASK ) )
        {
            postdiv = findPllPostDiv( pSetup->pllctrl, pSetup->pllpdec );
        }
        else
        {
            postdiv = 1U; /* The post-divider is bypassed. */
        }

        /* Adjust input clock */
        inPllRate = inPllRate / prediv;

        mMultFactional = ( double ) ( uint32_t ) ( pSetup->audpllfrac >> 15 ) +
                         ( double ) ( uint32_t ) Binary2Fractional( pSetup->audpllfrac & 0x7FFFU );
        workRate = ( double ) inPllRate * ( double ) mMultFactional;

        workRate = workRate / ( ( double ) postdiv );
        workRate = workRate * 2.0; /* SYS PLL hardware cco is divide by 2 before to M-DIVIDER*/
    }
    else
    {
        /* In bypass mode */
        workRate = ( double ) ( uint64_t ) inPllRate;
    }

    return ( uint32_t ) workRate;
}

/* Set the current PLL Rate */

/*! brief Store the current PLL rate
 *  param	rate: Current rate of the PLL
 *  return	Nothing
 **/
void CLOCK_SetStoredPLLClockRate( uint32_t rate )
{
    s_Pll_Freq = rate;
}

/* Set the current Audio PLL Rate */

/*! brief Store the current AUDIO PLL rate
 *  param	rate: Current rate of the PLL
 *  return	Nothing
 **/
void CLOCK_SetStoredAudioPLLClockRate( uint32_t rate )
{
    s_Audio_Pll_Freq = rate;
}

/* Set the current Usb PLL Rate */
void CLOCK_SetStoredUsbPLLClockRate( uint32_t rate )
{
    s_Usb_Pll_Freq = rate;
}

/* Return System PLL output clock rate */

/*! brief	Return System PLL output clock rate
 *  param	recompute	: Forces a PLL rate recomputation if true
 *  return	System PLL output clock rate
 *  note	The PLL rate is cached in the driver in a variable as
 *  the rate computation function can take some time to perform. It
 *  is recommended to use 'false' with the 'recompute' parameter.
 */
uint32_t CLOCK_GetSystemPLLOutClockRate( bool recompute )
{
    pll_setup_t Setup;
    uint32_t rate;

    if( ( recompute ) || ( s_Pll_Freq == 0U ) )
    {
        Setup.pllctrl = SYSCON->SYSPLLCTRL;
        Setup.pllndec = SYSCON->SYSPLLNDEC;
        Setup.pllpdec = SYSCON->SYSPLLPDEC;
        Setup.pllmdec = SYSCON->SYSPLLMDEC;

        CLOCK_GetSystemPLLOutFromSetupUpdate( &Setup );
    }

    rate = s_Pll_Freq;

    return rate;
}

/* Return AUDIO PLL output clock rate */

/*! brief	Return System AUDIO PLL output clock rate
 *  param	recompute	: Forces a AUDIO PLL rate recomputation if true
 *  return	System AUDIO PLL output clock rate
 *  note	The AUDIO PLL rate is cached in the driver in a variable as
 *  the rate computation function can take some time to perform. It
 *  is recommended to use 'false' with the 'recompute' parameter.
 */
uint32_t CLOCK_GetAudioPLLOutClockRate( bool recompute )
{
    pll_setup_t Setup;
    uint32_t rate;

    if( ( recompute ) || ( s_Audio_Pll_Freq == 0U ) )
    {
        Setup.pllctrl = SYSCON->AUDPLLCTRL;
        Setup.pllndec = SYSCON->AUDPLLNDEC;
        Setup.pllpdec = SYSCON->AUDPLLPDEC;
        Setup.pllmdec = SYSCON->AUDPLLMDEC;

        CLOCK_GetAudioPLLOutFromSetupUpdate( &Setup );
    }

    rate = s_Audio_Pll_Freq;
    return rate;
}

/* Return USB PLL output clock rate */
uint32_t CLOCK_GetUsbPLLOutClockRate( bool recompute )
{
    usb_pll_setup_t Setup;
    uint32_t rate;

    if( ( recompute ) || ( s_Usb_Pll_Freq == 0U ) )
    {
        Setup.msel = ( uint8_t ) ( ( SYSCON->USBPLLCTRL >> SYSCON_USBPLLCTRL_MSEL_SHIFT ) & SYSCON_USBPLLCTRL_MSEL_MASK );
        Setup.psel = ( uint8_t ) ( ( SYSCON->USBPLLCTRL >> SYSCON_USBPLLCTRL_PSEL_SHIFT ) & SYSCON_USBPLLCTRL_PSEL_MASK );
        Setup.nsel = ( uint8_t ) ( ( SYSCON->USBPLLCTRL >> SYSCON_USBPLLCTRL_NSEL_SHIFT ) & SYSCON_USBPLLCTRL_NSEL_MASK );
        Setup.fbsel = ( ( ( SYSCON->USBPLLCTRL >> SYSCON_USBPLLCTRL_FBSEL_SHIFT ) & SYSCON_USBPLLCTRL_FBSEL_MASK ) != 0UL );
        Setup.bypass =
            ( ( ( SYSCON->USBPLLCTRL >> SYSCON_USBPLLCTRL_BYPASS_SHIFT ) & SYSCON_USBPLLCTRL_BYPASS_MASK ) != 0UL );
        Setup.direct =
            ( ( ( SYSCON->USBPLLCTRL >> SYSCON_USBPLLCTRL_DIRECT_SHIFT ) & SYSCON_USBPLLCTRL_DIRECT_MASK ) != 0UL );
        CLOCK_GetUsbPLLOutFromSetupUpdate( &Setup );
    }

    rate = s_Usb_Pll_Freq;
    return rate;
}

/* Set PLL output based on the passed PLL setup data */

/*! brief	Set PLL output based on the passed PLL setup data
 *  param	pControl	: Pointer to populated PLL control structure to generate setup with
 *  param	pSetup		: Pointer to PLL setup structure to be filled
 *  return	PLL_ERROR_SUCCESS on success, or PLL setup error code
 *  note	Actual frequency for setup may vary from the desired frequency based on the
 *  accuracy of input clocks, rounding, non-fractional PLL mode, etc.
 */
pll_error_t CLOCK_SetupPLLData( pll_config_t * pControl,
                                pll_setup_t * pSetup )
{
    uint32_t inRate;
    pll_error_t pllError;

    /* Determine input rate for the PLL */
    if( ( pControl->flags & PLL_CONFIGFLAG_USEINRATE ) != 0U )
    {
        inRate = pControl->inputRate;
    }
    else
    {
        inRate = CLOCK_GetSystemPLLInClockRate();
    }

    /* PLL flag options */
    pllError = CLOCK_GetPllConfig( inRate, pControl->desiredRate, pSetup );
    pSetup->pllRate = pControl->desiredRate;
    return pllError;
}

/* Set PLL output from PLL setup structure */

/*! brief	Set PLL output from PLL setup structure (precise frequency)
 * param	pSetup	: Pointer to populated PLL setup structure
 * param flagcfg : Flag configuration for PLL config structure
 * return	PLL_ERROR_SUCCESS on success, or PLL setup error code
 * note	This function will power off the PLL, setup the PLL with the
 * new setup data, and then optionally powerup the PLL, wait for PLL lock,
 * and adjust system voltages to the new PLL rate. The function will not
 * alter any source clocks (ie, main systen clock) that may use the PLL,
 * so these should be setup prior to and after exiting the function.
 */
pll_error_t CLOCK_SetupSystemPLLPrec( pll_setup_t * pSetup,
                                      uint32_t flagcfg )
{
    if( ( SYSCON->SYSPLLCLKSEL & SYSCON_SYSPLLCLKSEL_SEL_MASK ) == 0x01U )
    {
        /* Turn on the ext clock if system pll input select clk_in */
        CLOCK_Enable_SysOsc( true );
    }

    /* Enable power for PLLs */
    POWER_SetPLL();
    /* Power off PLL during setup changes */
    POWER_EnablePD( kPDRUNCFG_PD_SYS_PLL0 );

    pSetup->flags = flagcfg;

    /* Write PLL setup data */
    SYSCON->SYSPLLCTRL = pSetup->pllctrl;
    SYSCON->SYSPLLNDEC = pSetup->pllndec;
    SYSCON->SYSPLLNDEC = pSetup->pllndec | ( 1UL << SYSCON_SYSPLLNDEC_NREQ_SHIFT ); /* latch */
    SYSCON->SYSPLLPDEC = pSetup->pllpdec;
    SYSCON->SYSPLLPDEC = pSetup->pllpdec | ( 1UL << SYSCON_SYSPLLPDEC_PREQ_SHIFT ); /* latch */
    SYSCON->SYSPLLMDEC = pSetup->pllmdec;
    SYSCON->SYSPLLMDEC = pSetup->pllmdec | ( 1UL << SYSCON_SYSPLLMDEC_MREQ_SHIFT ); /* latch */

    /* Flags for lock or power on */
    if( ( pSetup->flags & ( PLL_SETUPFLAG_POWERUP | PLL_SETUPFLAG_WAITLOCK ) ) != 0U )
    {
        /* If turning the PLL back on, perform the following sequence to accelerate PLL lock */
        uint32_t maxCCO = ( 1UL << 18U ) | 0x5dd2U; /* CCO = 1.6Ghz + MDEC enabled*/
        uint32_t curSSCTRL = SYSCON->SYSPLLMDEC & ~( 1UL << 17U );

        /* Initialize  and power up PLL */
        SYSCON->SYSPLLMDEC = maxCCO;
        POWER_DisablePD( kPDRUNCFG_PD_SYS_PLL0 );

        /* Set mreq to activate */
        SYSCON->SYSPLLMDEC = maxCCO | ( 1UL << 17U );

        /* Delay for 72 uSec @ 12Mhz */
        SDK_DelayAtLeastUs( 72U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY );

        /* clear mreq to prepare for restoring mreq */
        SYSCON->SYSPLLMDEC = curSSCTRL;

        /* set original value back and activate */
        SYSCON->SYSPLLMDEC = curSSCTRL | ( 1UL << 17U );

        /* Enable peripheral states by setting low */
        POWER_DisablePD( kPDRUNCFG_PD_SYS_PLL0 );
    }

    if( ( pSetup->flags & PLL_SETUPFLAG_WAITLOCK ) != 0U )
    {
        while( CLOCK_IsSystemPLLLocked() == false )
        {
        }
    }

    /* Update current programmed PLL rate var */
    CLOCK_GetSystemPLLOutFromSetupUpdate( pSetup );

    /* System voltage adjustment, occurs prior to setting main system clock */
    if( ( pSetup->flags & PLL_SETUPFLAG_ADGVOLT ) != 0U )
    {
        POWER_SetVoltageForFreq( s_Pll_Freq );
    }

    return kStatus_PLL_Success;
}

/* Set AUDIO PLL output from AUDIO PLL setup structure */

