FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.c
/*! brief	Set AUDIO PLL output from AUDIOPLL setup structure (precise frequency)
 * param	pSetup	: Pointer to populated PLL setup structure
 * param flagcfg : Flag configuration for PLL config structure
 * return	PLL_ERROR_SUCCESS on success, or PLL setup error code
 * note	This function will power off the PLL, setup the PLL with the
 * new setup data, and then optionally powerup the AUDIO PLL, wait for PLL lock,
 * and adjust system voltages to the new AUDIOPLL rate. The function will not
 * alter any source clocks (ie, main systen clock) that may use the AUDIO PLL,
 * so these should be setup prior to and after exiting the function.
 */
pll_error_t CLOCK_SetupAudioPLLPrec( pll_setup_t * pSetup,
                                     uint32_t flagcfg )
{
    if( ( SYSCON->AUDPLLCLKSEL & SYSCON_AUDPLLCLKSEL_SEL_MASK ) == 0x01U )
    {
        /* Turn on the ext clock if system pll input select clk_in */
        CLOCK_Enable_SysOsc( true );
    }

    /* Enable power VD3 for PLLs */
    POWER_SetPLL();
    /* Power off PLL during setup changes */
    POWER_EnablePD( kPDRUNCFG_PD_AUDIO_PLL );

    pSetup->flags = flagcfg;

    /* Write PLL setup data */
    SYSCON->AUDPLLCTRL = pSetup->pllctrl;
    SYSCON->AUDPLLNDEC = pSetup->pllndec;
    SYSCON->AUDPLLNDEC = pSetup->pllndec | ( 1UL << SYSCON_SYSPLLNDEC_NREQ_SHIFT ); /* latch */
    SYSCON->AUDPLLPDEC = pSetup->pllpdec;
    SYSCON->AUDPLLPDEC = pSetup->pllpdec | ( 1UL << SYSCON_SYSPLLPDEC_PREQ_SHIFT ); /* latch */
    SYSCON->AUDPLLMDEC = pSetup->pllmdec;
    SYSCON->AUDPLLMDEC = pSetup->pllmdec | ( 1UL << SYSCON_SYSPLLMDEC_MREQ_SHIFT ); /* latch */
    SYSCON->AUDPLLFRAC = SYSCON_AUDPLLFRAC_SEL_EXT( 1 );                            /* disable fractional function */

    /* Flags for lock or power on */
    if( ( pSetup->flags & ( PLL_SETUPFLAG_POWERUP | PLL_SETUPFLAG_WAITLOCK ) ) != 0U )
    {
        /* If turning the PLL back on, perform the following sequence to accelerate PLL lock */
        uint32_t maxCCO = ( 1UL << 18U ) | 0x5dd2U; /* CCO = 1.6Ghz + MDEC enabled*/
        uint32_t curSSCTRL = SYSCON->AUDPLLMDEC & ~( 1UL << 17U );

        /* Initialize  and power up PLL */
        SYSCON->AUDPLLMDEC = maxCCO;
        POWER_DisablePD( kPDRUNCFG_PD_AUDIO_PLL );

        /* Set mreq to activate */
        SYSCON->AUDPLLMDEC = maxCCO | ( 1UL << 17U );

        /* Delay for 72 uSec @ 12Mhz */
        SDK_DelayAtLeastUs( 72U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY );

        /* clear mreq to prepare for restoring mreq */
        SYSCON->AUDPLLMDEC = curSSCTRL;

        /* set original value back and activate */
        SYSCON->AUDPLLMDEC = curSSCTRL | ( 1UL << 17U );

        /* Enable peripheral states by setting low */
        POWER_DisablePD( kPDRUNCFG_PD_AUDIO_PLL );
    }

    if( ( pSetup->flags & PLL_SETUPFLAG_WAITLOCK ) != 0U )
    {
        while( CLOCK_IsAudioPLLLocked() == false )
        {
        }
    }

    /* Update current programmed PLL rate var */
    CLOCK_GetAudioPLLOutFromSetupUpdate( pSetup );

    return kStatus_PLL_Success;
}

/* Set AUDIO PLL output from AUDIO PLL fractional setup structure */

/*! brief	Set AUDIO PLL output from AUDIOPLL setup structure using the Audio Fractional divider register(precise
 * frequency)
 * param	pSetup	: Pointer to populated PLL setup structure
 * param flagcfg : Flag configuration for PLL config structure
 * return	PLL_ERROR_SUCCESS on success, or PLL setup error code
 * note	This function will power off the PLL, setup the PLL with the
 * new setup data, and then optionally powerup the AUDIO PLL, wait for PLL lock,
 * and adjust system voltages to the new AUDIOPLL rate. The function will not
 * alter any source clocks (ie, main systen clock) that may use the AUDIO PLL,
 * so these should be setup prior to and after exiting the function.
 */
pll_error_t CLOCK_SetupAudioPLLPrecFract( pll_setup_t * pSetup,
                                          uint32_t flagcfg )
{
    if( ( SYSCON->AUDPLLCLKSEL & SYSCON_AUDPLLCLKSEL_SEL_MASK ) == 0x01U )
    {
        /* Turn on the ext clock if system pll input select clk_in */
        CLOCK_Enable_SysOsc( true );
    }

    /* Enable power VD3 for PLLs */
    POWER_SetPLL();
    /* Power off PLL during setup changes */
    POWER_EnablePD( kPDRUNCFG_PD_AUDIO_PLL );

    pSetup->flags = flagcfg;

    /* Write PLL setup data */
    SYSCON->AUDPLLCTRL = pSetup->pllctrl;
    SYSCON->AUDPLLNDEC = pSetup->pllndec;
    SYSCON->AUDPLLNDEC = pSetup->pllndec | ( 1UL << SYSCON_SYSPLLNDEC_NREQ_SHIFT ); /* latch */
    SYSCON->AUDPLLPDEC = pSetup->pllpdec;
    SYSCON->AUDPLLPDEC = pSetup->pllpdec | ( 1UL << SYSCON_SYSPLLPDEC_PREQ_SHIFT ); /* latch */
    SYSCON->AUDPLLMDEC = pSetup->pllmdec;
    SYSCON->AUDPLLFRAC = SYSCON_AUDPLLFRAC_SEL_EXT( 0 );                            /* enable fractional function */
    SYSCON->AUDPLLFRAC = pSetup->audpllfrac;
    SYSCON->AUDPLLFRAC = pSetup->audpllfrac | ( 1UL << SYSCON_AUDPLLFRAC_REQ_SHIFT );

    /* Enable peripheral states by setting low */
    POWER_DisablePD( kPDRUNCFG_PD_AUDIO_PLL );

    if( ( pSetup->flags & PLL_SETUPFLAG_WAITLOCK ) != 0U )
    {
        while( CLOCK_IsAudioPLLLocked() == false )
        {
        }
    }

    /* Update current programmed PLL rate var */
    CLOCK_GetAudioPLLOutFromAudioFracSetupUpdate( pSetup );

    return kStatus_PLL_Success;
}

/* Set Audio PLL output based on the passed Audio PLL setup data */

/*! brief	Set AUDIO PLL output based on the passed AUDIO PLL setup data
 *  param	pControl	: Pointer to populated PLL control structure to generate setup with
 *  param	pSetup		: Pointer to PLL setup structure to be filled
 *  return	PLL_ERROR_SUCCESS on success, or PLL setup error code
 *  note	Actual frequency for setup may vary from the desired frequency based on the
 *  accuracy of input clocks, rounding, non-fractional PLL mode, etc.
 */
pll_error_t CLOCK_SetupAudioPLLData( pll_config_t * pControl,
                                     pll_setup_t * pSetup )
{
    uint32_t inRate;
    pll_error_t pllError;

    /* Determine input rate for the PLL */
    if( ( pControl->flags & PLL_CONFIGFLAG_USEINRATE ) != 0U )
    {
        inRate = pControl->inputRate;
    }
    else
    {
        inRate = CLOCK_GetAudioPLLInClockRate();
    }

    /* PLL flag options */
    pllError = CLOCK_GetPllConfig( inRate, pControl->desiredRate, pSetup );
    pSetup->pllRate = pControl->desiredRate;
    return pllError;
}

