FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.c
/* Setup PLL Frequency from pre-calculated value */

/**
 * brief	Set PLL output from PLL setup structure (precise frequency)
 * param	pSetup	: Pointer to populated PLL setup structure
 * return	kStatus_PLL_Success on success, or PLL setup error code
 * note	This function will power off the PLL, setup the PLL with the
 * new setup data, and then optionally powerup the PLL, wait for PLL lock,
 * and adjust system voltages to the new PLL rate. The function will not
 * alter any source clocks (ie, main systen clock) that may use the PLL,
 * so these should be setup prior to and after exiting the function.
 */
pll_error_t CLOCK_SetPLLFreq( const pll_setup_t * pSetup )
{
    if( ( SYSCON->SYSPLLCLKSEL & SYSCON_SYSPLLCLKSEL_SEL_MASK ) == 0x01U )
    {
        /* Turn on the ext clock if system pll input select clk_in */
        CLOCK_Enable_SysOsc( true );
    }

    /* Enable power VD3 for PLLs */
    POWER_SetPLL();
    /* Power off PLL during setup changes */
    POWER_EnablePD( kPDRUNCFG_PD_SYS_PLL0 );

    /* Write PLL setup data */
    SYSCON->SYSPLLCTRL = pSetup->pllctrl;
    SYSCON->SYSPLLNDEC = pSetup->pllndec;
    SYSCON->SYSPLLNDEC = pSetup->pllndec | ( 1UL << SYSCON_SYSPLLNDEC_NREQ_SHIFT ); /* latch */
    SYSCON->SYSPLLPDEC = pSetup->pllpdec;
    SYSCON->SYSPLLPDEC = pSetup->pllpdec | ( 1UL << SYSCON_SYSPLLPDEC_PREQ_SHIFT ); /* latch */
    SYSCON->SYSPLLMDEC = pSetup->pllmdec;
    SYSCON->SYSPLLMDEC = pSetup->pllmdec | ( 1UL << SYSCON_SYSPLLMDEC_MREQ_SHIFT ); /* latch */

    /* Flags for lock or power on */
    if( ( pSetup->flags & ( PLL_SETUPFLAG_POWERUP | PLL_SETUPFLAG_WAITLOCK ) ) != 0U )
    {
        /* If turning the PLL back on, perform the following sequence to accelerate PLL lock */
        uint32_t maxCCO = ( 1UL << 18U ) | 0x5dd2U; /* CCO = 1.6Ghz + MDEC enabled*/
        uint32_t curSSCTRL = SYSCON->SYSPLLMDEC & ~( 1UL << 17U );

        /* Initialize  and power up PLL */
        SYSCON->SYSPLLMDEC = maxCCO;
        POWER_DisablePD( kPDRUNCFG_PD_SYS_PLL0 );

        /* Set mreq to activate */
        SYSCON->SYSPLLMDEC = maxCCO | ( 1UL << 17U );

        /* Delay for 72 uSec @ 12Mhz */
        SDK_DelayAtLeastUs( 72U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY );

        /* clear mreq to prepare for restoring mreq */
        SYSCON->SYSPLLMDEC = curSSCTRL;

        /* set original value back and activate */
        SYSCON->SYSPLLMDEC = curSSCTRL | ( 1UL << 17U );

        /* Enable peripheral states by setting low */
        POWER_DisablePD( kPDRUNCFG_PD_SYS_PLL0 );
    }

    if( ( pSetup->flags & PLL_SETUPFLAG_WAITLOCK ) != 0U )
    {
        while( CLOCK_IsSystemPLLLocked() == false )
        {
        }
    }

    /* Update current programmed PLL rate var */
    s_Pll_Freq = pSetup->pllRate;

    return kStatus_PLL_Success;
}

/* Setup Audio PLL Frequency from pre-calculated value */

/**
 * brief	Set Audio PLL output from Audio PLL setup structure (precise frequency)
 * param	pSetup	: Pointer to populated PLL setup structure
 * return	kStatus_PLL_Success on success, or Audio PLL setup error code
 * note	This function will power off the PLL, setup the Audio PLL with the
 * new setup data, and then optionally powerup the PLL, wait for Audio PLL lock,
 * and adjust system voltages to the new PLL rate. The function will not
 * alter any source clocks (ie, main systen clock) that may use the Audio PLL,
 * so these should be setup prior to and after exiting the function.
 */
pll_error_t CLOCK_SetAudioPLLFreq( const pll_setup_t * pSetup )
{
    if( ( SYSCON->AUDPLLCLKSEL & SYSCON_AUDPLLCLKSEL_SEL_MASK ) == 0x01U )
    {
        /* Turn on the ext clock if system pll input select clk_in */
        CLOCK_Enable_SysOsc( true );
    }

    /* Enable power VD3 for PLLs */
    POWER_SetPLL();
    /* Power off Audio PLL during setup changes */
    POWER_EnablePD( kPDRUNCFG_PD_AUDIO_PLL );

    /* Write Audio PLL setup data */
    SYSCON->AUDPLLCTRL = pSetup->pllctrl;
    SYSCON->AUDPLLFRAC = pSetup->audpllfrac;
    SYSCON->AUDPLLFRAC = pSetup->audpllfrac | ( 1UL << SYSCON_AUDPLLFRAC_REQ_SHIFT ); /* latch */
    SYSCON->AUDPLLNDEC = pSetup->pllndec;
    SYSCON->AUDPLLNDEC = pSetup->pllndec | ( 1UL << SYSCON_AUDPLLNDEC_NREQ_SHIFT );   /* latch */
    SYSCON->AUDPLLPDEC = pSetup->pllpdec;
    SYSCON->AUDPLLPDEC = pSetup->pllpdec | ( 1UL << SYSCON_AUDPLLPDEC_PREQ_SHIFT );   /* latch */
    SYSCON->AUDPLLMDEC = pSetup->pllmdec;
    SYSCON->AUDPLLMDEC = pSetup->pllmdec | ( 1UL << SYSCON_AUDPLLMDEC_MREQ_SHIFT );   /* latch */
    SYSCON->AUDPLLFRAC = SYSCON_AUDPLLFRAC_SEL_EXT( 1 );                              /* disable fractional function */

    /* Flags for lock or power on */
    if( ( pSetup->flags & ( PLL_SETUPFLAG_POWERUP | PLL_SETUPFLAG_WAITLOCK ) ) != 0U )
    {
        /* If turning the PLL back on, perform the following sequence to accelerate PLL lock */
        uint32_t maxCCO = ( 1UL << 18U ) | 0x5dd2U; /* CCO = 1.6Ghz + MDEC enabled*/
        uint32_t curSSCTRL = SYSCON->SYSPLLMDEC & ~( 1UL << 17U );

        /* Initialize  and power up PLL */
        SYSCON->SYSPLLMDEC = maxCCO;
        POWER_DisablePD( kPDRUNCFG_PD_AUDIO_PLL );

        /* Set mreq to activate */
        SYSCON->SYSPLLMDEC = maxCCO | ( 1UL << 17U );

        /* Delay for 72 uSec @ 12Mhz */
        SDK_DelayAtLeastUs( 72U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY );

        /* clear mreq to prepare for restoring mreq */
        SYSCON->SYSPLLMDEC = curSSCTRL;

        /* set original value back and activate */
        SYSCON->SYSPLLMDEC = curSSCTRL | ( 1UL << 17U );

        /* Enable peripheral states by setting low */
        POWER_DisablePD( kPDRUNCFG_PD_AUDIO_PLL );
    }

    if( ( pSetup->flags & PLL_SETUPFLAG_WAITLOCK ) != 0U )
    {
        while( CLOCK_IsAudioPLLLocked() == false )
        {
        }
    }

    /* Update current programmed PLL rate var */
    s_Audio_Pll_Freq = pSetup->pllRate;

    return kStatus_PLL_Success;
}

/* Setup USB PLL Frequency from pre-calculated value */

/**
 * brief	Set USB PLL output from USB PLL setup structure (precise frequency)
 * param	pSetup	: Pointer to populated USB PLL setup structure
 * return	kStatus_PLL_Success on success, or USB PLL setup error code
 * note	This function will power off the USB PLL, setup the PLL with the
 * new setup data, and then optionally powerup the USB PLL, wait for USB PLL lock,
 * and adjust system voltages to the new USB PLL rate. The function will not
 * alter any source clocks (ie, usb pll clock) that may use the USB PLL,
 * so these should be setup prior to and after exiting the function.
 */
pll_error_t CLOCK_SetUsbPLLFreq( const usb_pll_setup_t * pSetup )
{
    uint32_t usbpllctrl, fccoHz;
    uint8_t msel, psel, nsel;
    bool pllDirectInput, pllDirectOutput, pllfbsel;

    msel = pSetup->msel;
    psel = pSetup->psel;
    nsel = pSetup->nsel;
    pllDirectOutput = pSetup->direct;
    pllDirectInput = pSetup->bypass;
    pllfbsel = pSetup->fbsel;

