FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.c
    /* Input clock into the PLL cannot be lower than this */
    if( pSetup->inputRate < USB_PLL_LOWER_IN_LIMIT )
    {
        return kStatus_PLL_InputTooLow;
    }

    if( pllfbsel )
    {
        /*integer_mode: Fout = M*(Fin/N),  Fcco = 2*P*M*(Fin/N) */
        fccoHz = ( pSetup->inputRate / ( ( uint32_t ) nsel + 1U ) ) * 2U * ( msel + 1U ) * SWITCH_USB_PSEL( psel );

        /* USB PLL CCO out rate cannot be lower than this */
        if( fccoHz < USB_PLL_MIN_CCO_FREQ_MHZ )
        {
            return kStatus_PLL_CCOTooLow;
        }

        /* USB PLL CCO out rate cannot be Higher than this */
        if( fccoHz > USB_PLL_MAX_CCO_FREQ_MHZ )
        {
            return kStatus_PLL_CCOTooHigh;
        }
    }
    else
    {
        /* non integer_mode: Fout = M*(Fin/N)/(2*P), Fcco = M * (Fin/N) */
        fccoHz = pSetup->inputRate / ( ( uint32_t ) nsel + 1U ) * ( msel + 1U );

        /* USB PLL CCO out rate cannot be lower than this */
        if( fccoHz < USB_PLL_MIN_CCO_FREQ_MHZ )
        {
            return kStatus_PLL_CCOTooLow;
        }

        /* USB PLL CCO out rate cannot be Higher than this */
        if( fccoHz > USB_PLL_MAX_CCO_FREQ_MHZ )
        {
            return kStatus_PLL_CCOTooHigh;
        }
    }

    /* If configure the USB HOST clock, VD5 power for USB PHY should be enable
     * before the PLL is working */
    /* Turn on the ext clock for usb pll input */
    CLOCK_Enable_SysOsc( true );

    /* Enable power VD3 for PLLs */
    POWER_SetPLL();

    /* Power on the VD5 for USB PHY */
    POWER_SetUsbPhy();

    /* Power off USB PLL during setup changes */
    POWER_EnablePD( kPDRUNCFG_PD_USB_PLL );

    /* Write USB PLL setup data */
    usbpllctrl = USB_PLL_NSEL_VAL_SET( nsel ) |                                   /* NSEL VALUE */
                 USB_PLL_PSEL_VAL_SET( psel ) |                                   /* PSEL VALUE */
                 USB_PLL_MSEL_VAL_SET( msel ) |                                   /* MSEL VALUE */
                 ( uint32_t ) pllDirectInput << SYSCON_USBPLLCTRL_BYPASS_SHIFT |  /* BYPASS DISABLE */
                 ( uint32_t ) pllDirectOutput << SYSCON_USBPLLCTRL_DIRECT_SHIFT | /* DIRECTO DISABLE */
                 ( uint32_t ) pllfbsel << SYSCON_USBPLLCTRL_FBSEL_SHIFT;          /* FBSEL SELECT */

    SYSCON->USBPLLCTRL = usbpllctrl;

    POWER_DisablePD( kPDRUNCFG_PD_USB_PLL );

    /* Delay for 72 uSec @ 12Mhz for the usb pll to lock */
    SDK_DelayAtLeastUs( 72U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY );

    if( false == pllDirectInput )
    {
        while( CLOCK_IsUsbPLLLocked() == false )
        {
        }
    }

    CLOCK_GetUsbPLLOutFromSetupUpdate( pSetup );
    return kStatus_PLL_Success;
}

/* Set System PLL clock based on the input frequency and multiplier */

/*! brief	Set PLL output based on the multiplier and input frequency
 * param	multiply_by	: multiplier
 * param	input_freq	: Clock input frequency of the PLL
 * return	Nothing
 * note	Unlike the Chip_Clock_SetupSystemPLLPrec() function, this
 * function does not disable or enable PLL power, wait for PLL lock,
 * or adjust system voltages. These must be done in the application.
 * The function will not alter any source clocks (ie, main systen clock)
 * that may use the PLL, so these should be setup prior to and after
 * exiting the function.
 */
void CLOCK_SetupSystemPLLMult( uint32_t multiply_by,
                               uint32_t input_freq )
{
    uint32_t cco_freq = input_freq * multiply_by;
    uint32_t pdec = 1U;
    uint32_t selr;
    uint32_t seli;
    uint32_t selp;
    uint32_t mdec, ndec;

    uint32_t directo = SYSCON_SYSPLLCTRL_DIRECTO( 1 );

    while( cco_freq < 275000000U )
    {
        multiply_by <<= 1U; /* double value in each iteration */
        pdec <<= 1U;        /* correspondingly double pdec to cancel effect of double msel */
        cco_freq = input_freq * multiply_by;
    }

    selr = 0U;

    if( multiply_by < 60U )
    {
        seli = ( multiply_by & 0x3cU ) + 4U;
        selp = ( multiply_by >> 1U ) + 1U;
    }
    else
    {
        selp = 31U;

        if( multiply_by > 16384U )
        {
            seli = 1U;
        }
        else if( multiply_by > 8192U )
        {
            seli = 2U;
        }
        else if( multiply_by > 2048U )
        {
            seli = 4U;
        }
        else if( multiply_by >= 501U )
        {
            seli = 8U;
        }
        else
        {
            seli = 4U * ( 1024U / ( multiply_by + 9U ) );
        }
    }

    if( pdec > 1U )
    {
        directo = 0U;     /* use post divider */
        pdec = pdec / 2U; /* Account for minus 1 encoding */

        /* Translate P value */
        switch( pdec )
        {
            case 1U:
                pdec = 0x62U; /* 1  * 2 */
                break;

            case 2U:
                pdec = 0x42U; /* 2  * 2 */
                break;

            case 4U:
                pdec = 0x02U; /* 4  * 2 */
                break;

            case 8U:
                pdec = 0x0bU; /* 8  * 2 */
                break;

            case 16U:
                pdec = 0x11U; /* 16 * 2 */
                break;

            case 32U:
                pdec = 0x08U; /* 32 * 2 */
                break;

            default:
                pdec = 0x08U;
                break;
        }
    }

    mdec = PLL_MDEC_VAL_SET( pllEncodeM( multiply_by ) );
    ndec = 0x302U; /* pre divide by 1 (hardcoded) */

    SYSCON->SYSPLLCTRL = directo | ( selr << SYSCON_SYSPLLCTRL_SELR_SHIFT ) | ( seli << SYSCON_SYSPLLCTRL_SELI_SHIFT ) |
                         ( selp << SYSCON_SYSPLLCTRL_SELP_SHIFT );
    SYSCON->SYSPLLPDEC = pdec | ( 1U << 7U );   /* set Pdec value and assert preq */
    SYSCON->SYSPLLNDEC = ndec | ( 1UL << 10U ); /* set Pdec value and assert preq */
    SYSCON->SYSPLLMDEC = ( 1UL << 17U ) | mdec; /* select non sscg MDEC value, assert mreq and select mdec value */
}

/* Enable USB DEVICE FULL SPEED clock */

/*! brief Enable USB Device FS clock.
 * param	src	: clock source
 * param	freq: clock frequency
 * Enable USB Device Full Speed clock.
 */
bool CLOCK_EnableUsbfs0DeviceClock( clock_usb_src_t src,
                                    uint32_t freq )
{
    bool ret = true;

    CLOCK_DisableClock( kCLOCK_Usbd0 );

    if( kCLOCK_UsbSrcFro == src )
    {
        switch( freq )
        {
            case 96000000U:
                CLOCK_SetClkDiv( kCLOCK_DivUsb0Clk, 2U, false ); /*!< Div by 2 to get 48MHz, no divider reset */
                break;

            case 48000000U:
                CLOCK_SetClkDiv( kCLOCK_DivUsb0Clk, 1U, false ); /*!< Div by 1 to get 48MHz, no divider reset */
                break;

            default:
                ret = false;
                break;
        }

