FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_clock.c
        /* Turn ON FRO HF and let it adjust TRIM value based on USB SOF */
        SYSCON->FROCTRL = ( SYSCON->FROCTRL & ~( ( 0x01UL << 15U ) | ( 0xFUL << 26U ) ) ) | SYSCON_FROCTRL_HSPDCLK_MASK |
                          SYSCON_FROCTRL_USBCLKADJ_MASK;
        /* Select FRO 96 or 48 MHz */
        CLOCK_AttachClk( kFRO_HF_to_USB0_CLK );
    }
    else
    {
        /*Set the USB PLL as the Usb0 CLK*/
        POWER_DisablePD( kPDRUNCFG_PD_USB_PLL );

        usb_pll_setup_t pll_setup = { 0x3FU, 0x01U, 0x03U, false, false, false, 12000000U };

        ( void ) CLOCK_SetUsbPLLFreq( &pll_setup );
        CLOCK_SetClkDiv( kCLOCK_DivUsb0Clk, 1U, false );
        CLOCK_AttachClk( kUSB_PLL_to_USB0_CLK );
        SDK_DelayAtLeastUs( 50U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY );
    }

    CLOCK_EnableClock( kCLOCK_Usbd0 );
    CLOCK_EnableClock( kCLOCK_UsbRam1 );

    return ret;
}

/* Enable USB HOST FULL SPEED clock */

/*! brief Enable USB HOST FS clock.
 * param	src	: clock source
 * param	freq: clock frequency
 * Enable USB HOST Full Speed clock.
 */
bool CLOCK_EnableUsbfs0HostClock( clock_usb_src_t src,
                                  uint32_t freq )
{
    bool ret = true;

    CLOCK_DisableClock( kCLOCK_Usbhmr0 );
    CLOCK_DisableClock( kCLOCK_Usbhsl0 );

    if( kCLOCK_UsbSrcFro == src )
    {
        switch( freq )
        {
            case 96000000U:
                CLOCK_SetClkDiv( kCLOCK_DivUsb0Clk, 2U, false ); /*!< Div by 2 to get 48MHz, no divider reset */
                break;

            case 48000000U:
                CLOCK_SetClkDiv( kCLOCK_DivUsb0Clk, 1U, false ); /*!< Div by 1 to get 48MHz, no divider reset */
                break;

            default:
                ret = false;
                break;
        }

        /* Turn ON FRO HF and let it adjust TRIM value based on USB SOF */
        SYSCON->FROCTRL = ( SYSCON->FROCTRL & ~( ( 0x01UL << 15U ) | ( 0xFUL << 26U ) ) ) | SYSCON_FROCTRL_HSPDCLK_MASK |
                          SYSCON_FROCTRL_USBCLKADJ_MASK;
        /* Select FRO 96 or 48 MHz */
        CLOCK_AttachClk( kFRO_HF_to_USB0_CLK );
    }
    else
    {
        /*Set the USB PLL as the Usb0 CLK*/
        POWER_DisablePD( kPDRUNCFG_PD_USB_PLL );

        usb_pll_setup_t pll_setup = { 0x3FU, 0x01U, 0x03U, false, false, false, 12000000U };

        ( void ) CLOCK_SetUsbPLLFreq( &pll_setup );
        CLOCK_SetClkDiv( kCLOCK_DivUsb0Clk, 1U, false );
        CLOCK_AttachClk( kUSB_PLL_to_USB0_CLK );
        SDK_DelayAtLeastUs( 50U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY );
    }

    CLOCK_EnableClock( kCLOCK_Usbhmr0 );
    CLOCK_EnableClock( kCLOCK_Usbhsl0 );
    CLOCK_EnableClock( kCLOCK_UsbRam1 );

    return ret;
}

/* Enable USB DEVICE HIGH SPEED clock */

/*! brief Enable USB Device HS clock.
 * param	src	: clock source
 * param	freq: clock frequency
 * Enable USB Device High Speed clock.
 */
bool CLOCK_EnableUsbhs0DeviceClock( clock_usb_src_t src,
                                    uint32_t freq )
{
    bool ret = true;

    CLOCK_DisableClock( kCLOCK_Usbd1 );
    /* Power on the VD5 for USB PHY */
    POWER_SetUsbPhy();

    if( kCLOCK_UsbSrcFro == src )
    {
        switch( freq )
        {
            case 96000000U:
                CLOCK_SetClkDiv( kCLOCK_DivUsb1Clk, 2U, false ); /*!< Div by 2 to get 48MHz, no divider reset */
                break;

            case 48000000U:
                CLOCK_SetClkDiv( kCLOCK_DivUsb1Clk, 1U, false ); /*!< Div by 1 to get 48MHz, no divider reset */
                break;

            default:
                ret = false;
                break;
        }

        /* Turn ON FRO HF and let it adjust TRIM value based on USB SOF */
        SYSCON->FROCTRL = ( SYSCON->FROCTRL & ~( ( 0x01UL << 15U ) | ( 0xFUL << 26U ) ) ) | SYSCON_FROCTRL_HSPDCLK_MASK |
                          SYSCON_FROCTRL_USBCLKADJ_MASK;
        /* Select FRO 96 or 48 MHz */
        CLOCK_AttachClk( kFRO_HF_to_USB1_CLK );
    }
    else
    {
        SDK_DelayAtLeastUs( 50, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY );
        usb_pll_setup_t pll_setup = { 0x3FU, 0x01U, 0x03U, false, false, false, 12000000U };

        ( void ) CLOCK_SetUsbPLLFreq( &pll_setup );

        /* Select USB PLL output as USB clock src */
        CLOCK_SetClkDiv( kCLOCK_DivUsb1Clk, 1U, false );
        CLOCK_AttachClk( kUSB_PLL_to_USB1_CLK );
    }

    SDK_DelayAtLeastUs( 50, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY );
    /* Enable USB1D and USB1RAM */
    CLOCK_EnableClock( kCLOCK_Usbd1 );
    CLOCK_EnableClock( kCLOCK_UsbRam1 );
    POWER_DisablePD( kPDRUNCFG_PD_USB1_PHY ); /* Turn on power for USB PHY */
    return ret;
}

/* Enable USB HOST HIGH SPEED clock */

/*! brief Enable USB HOST HS clock.
 * param	src	: clock source
 * param	freq: clock frequency
 * Enable USB HOST High Speed clock.
 */
bool CLOCK_EnableUsbhs0HostClock( clock_usb_src_t src,
                                  uint32_t freq )
{
    bool ret = true;

    CLOCK_DisableClock( kCLOCK_Usbh1 );
    /* Power on the VD5 for USB PHY */
    POWER_SetUsbPhy();

    if( kCLOCK_UsbSrcFro == src )
    {
        switch( freq )
        {
            case 96000000U:
                CLOCK_SetClkDiv( kCLOCK_DivUsb1Clk, 2U, false ); /*!< Div by 2 to get 48MHz, no divider reset */
                break;

            case 48000000U:
                CLOCK_SetClkDiv( kCLOCK_DivUsb1Clk, 1U, false ); /*!< Div by 1 to get 48MHz, no divider reset */
                break;

            default:
                ret = false;
                break;
        }

        /* Turn ON FRO HF and let it adjust TRIM value based on USB SOF */
        SYSCON->FROCTRL = ( SYSCON->FROCTRL & ~( ( 0x01UL << 15U ) | ( 0xFUL << 26U ) ) ) | SYSCON_FROCTRL_HSPDCLK_MASK |
                          SYSCON_FROCTRL_USBCLKADJ_MASK;
        /* Select FRO 96 or 48 MHz */
        CLOCK_AttachClk( kFRO_HF_to_USB1_CLK );
    }
    else
    {
        SDK_DelayAtLeastUs( 50U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY );
        usb_pll_setup_t pll_setup = { 0x3FU, 0x01U, 0x03U, false, false, false, 12000000U };

        ( void ) CLOCK_SetUsbPLLFreq( &pll_setup );

        /* Select USB PLL output as USB clock src */
        CLOCK_SetClkDiv( kCLOCK_DivUsb1Clk, 1U, false );
        CLOCK_AttachClk( kUSB_PLL_to_USB1_CLK );
    }

    SDK_DelayAtLeastUs( 50, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY );
    /* Enable USBh1 and USB1RAM */
    CLOCK_EnableClock( kCLOCK_Usbh1 );
    CLOCK_EnableClock( kCLOCK_UsbRam1 );
    POWER_DisablePD( kPDRUNCFG_PD_USB1_PHY ); /* Turn on power for USB PHY */
    return ret;
}
